[
  {
    "_id": {
      "$id": "53af0c071414141d48963a01"
    },
    "short_abstract": "Prednosti i mane korištenja LINQ to SQL object-relational mappinga potkrijepljeni primjerima iz \"stvarnog života\".",
    "language": "Croatian",
    "title": "LINQ to SQL - prednosti, mane i zamke",
    "level": "Intermediate",
    "submitted": {
      "sec": 1401235710,
      "usec": 0
    },
    "row_id": 6,
    "long_abstract": "Jedna od glavnih okosnica web programiranja je komunikacija sa bazom podataka. U današnje vrijeme komunikacija aplikacije s bazom podataka se u većin slučajeva odvija preko međunivoa koji programeru značajno krati vrijeme razvoja. Jedan od takvih nivoa je i object-relational mapping. I među iskusnim programerima postoji mnogo mistifikacije oko tog pristupa.  Pokušati ću dati što je moguće jasniji pregled glavnih prednosti, mana i zamki (kojih ima na pretek) pri korištenju LINQ to SQL. Primjeri će biti u C# jeziku.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bac14141403187e969f"
      },
      "github": "",
      "short_bio": "Pirat. Blogger. IT Specialist, dog and cat lover, web app. developer & arhitect. @PiratskaHRV #EP2014 Candidate. Too-Much-Coffee-Man. Father and husband.",
      "name": "Petar A. Vrdoljak",
      "twitter": "@petarav",
      "long_bio": "IT specialist with almost 30 years of experience. Working at INA d.d. for more than 15 years with current possition as IS Development Specialist. Professional and private circles of interest are pointing to web developement, net security and net neutrality. As active Member of Pirate Party Croatia competed as candidate at 2014. EU Parliament elections.",
      "image": "http://emocija.biz/img/PetarAV.png",
      "shirt": "Male XXL"
    }
  },
  {
    "_id": {
      "$id": "53afe8981414142aa06cee7b"
    },
    "short_abstract": "One application, multiple owners - what we had to predict in project faze and how we implement it in our real life project in building a 'software as a service' multittenant application. ",
    "language": "English",
    "title": "Multitennant Web Application Development Challenges",
    "level": "Intermediate",
    "submitted": {
      "sec": 1404039035,
      "usec": 0
    },
    "row_id": 40,
    "long_abstract": "One application, multiple owners - what we had to predict in project faze and how we implement it in our real life project in building a 'software as a service' multitenant application. From architecture and  \ndata model to code writing practice and testing. Challenges that we solved: how to partition data, tenant based design themes, be prepared for custom modules or application behaviors, how we setup our  \ndevelopment tools, what to do with default authentication and authorization behaviors and did we had to write some special unit tests. We will answer all of this questions showing working Conference@Net application and their modules Conference@Net Web, Conference@Net Mobile and Conference@Net Motion.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53afe8981414142aa06cee7a"
      },
      "github": "",
      "short_bio": "Developer, working on different web projects for more than 10 years.",
      "name": "Dobriša Adamec",
      "twitter": "dadamec",
      "long_bio": "Dobriša Adamec is Solution Architect in Citus company (Croatia, Zagreb) working on different projects and building service oriented applications. Many years of experience in writing code, deploying  living applications, setting and walking up projects, and building  a team are used at today’s  specializations: .NET, web services, interoperability.  While using new technologies  every day he's teaching students at Tehničko Veleučilšte Zagreb with courses such as \"dotNET Framework\" and “XML programming – web services”. As active member of HUPRO/SQLDevelopers communities he become the INETA VP for Memberhip. The commitment to the community has led to obtaining the Microsoft MVP status for ASP.NET.",
      "image": "http://mobilityday.com/Content/MobilityDay2013/uploads/dobrisa_adamecCITUS.jpg",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53dc99bb6fc3850d17182e1d"
    },
    "status": "accepted",
    "short_abstract": "This talk will cover the goods and the bads of choosing  javascript as a solution for everything. ",
    "long_abstract": "Let us start by quoting Atwood's Law: “any application that can be written in JavaScript, will eventually be written in JavaScript”. And so it came to be - you either love it or hate it but JavaScript became the “all solving hammer”. It has come to the point that you can write anything in it - including your very own desktop and mobile application, using only web frontend technologies ruled by the almighty JavaScript.\nThe secret ingredient for this recipe is to “just add JavaScript”. In this talk some alternatives to native desktop and mobile development will be presented. There will be alternatives such as phonegap, node-webit and even something promising as NativeScript. But it won’t just sing praises to the mighty JavaScript king it will also cover the dark side of developing this type of software.",
    "language": "English",
    "title": "Building applications with a hammer ",
    "level": "Elementary",
    "submitted": {
      "sec": 1406907310,
      "usec": 0
    },
    "row_id": 102,
    "speaker": {
      "_id": {
        "$id": "53dc99b96fc3850d17182e1c"
      },
      "github": "",
      "short_bio": "JavaScript connoisseur",
      "name": "Kresimir Antolic ",
      "twitter": "Kantolic ",
      "long_bio": "The main reason why Kresimir entered the mystical world of web development is the fact he had no Internet access while growing up. Once he was introduced to its magic he instantly fell in love with it and all the possibilities this platform provides.  Now he’s passionate about the Web and having the possibility to work on it and hopes to do so for many years to come.\n\nHe spends his days as a JavaScript Team Dictator at Infinum. He loves his job and the Web.",
      "image": "https://pbs-0.twimg.com/profile_images/426061032759386112/arbGRnew.jpeg",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53af0c0c1414141d48963a15"
    },
    "short_abstract": "Toxic is a Nginx + PHP + Python combination which will allow migrate existing web application to async working web server and write some async parts using Python and PHP.",
    "language": "English",
    "title": "Toxic Async web development platform",
    "level": "Intermediate",
    "submitted": {
      "sec": 1403020611,
      "usec": 0
    },
    "row_id": 26,
    "long_abstract": "For now it's just in early development state , but even now it works faster that the standard web application backend providers such as Apache + PHP or Nginx + PHP FastCGI.\n\nThe core goal for this project is to write fast async web server for non async programming languages.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bb014141403187e96af"
      },
      "github": "tigran-bayburtsyan",
      "short_bio": "I'm Web and Desktop application developer for more than 9 years.\nI'm developing applications using PHP , Python , C# JavaScript and many other relevant technologies and programming languages.\n\nI'm owner at http://testedbrain.am which is a online skill testing platform for companies local testing , written on Node.js + MySQL",
      "name": "Tigran Bayburtsyan",
      "twitter": "",
      "long_bio": "I'm located in Armenia and I've studied at Yerevan State University in Applied Mathematics faculty.\n\nIn most part of my professional career I've worked in Odes.com as Freelancer.\nNow I'm working in American University of Armenia as Software Development department lead.\n\nI'm always creating new thing and bringing to live my creative ideas.\n",
      "image": "https://avatars3.githubusercontent.com/u/3198658?s=500",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53d4d7696fc385384df6618f"
    },
    "status": "accepted",
    "short_abstract": "A short talk on how to remove Photoshop (and other Adobe tools) from your daily workflow for UI design.",
    "long_abstract": "**for your eyes only, will write a better description if selected**\n\nPhotoshop is the most commonly tool used for UI and web design. However, over the past two-three years other tools have emerged and have taken the design community by storm. This talk will focus mostly on designing for web and mobile using Sketch (by Bohemian Coding) and some minor image editing with Pixelmator.",
    "language": "English",
    "title": "Ditch Photoshop for UI design",
    "level": "Elementary",
    "submitted": {
      "sec": 1405611141,
      "usec": 0
    },
    "row_id": 68,
    "speaker": {
      "_id": {
        "$id": "53d4d7686fc385384df6618e"
      },
      "github": "",
      "short_bio": "Full-stack web developer and UI designer, currently bringing cows to clouds @farmeron",
      "name": "Ivan Bernat",
      "twitter": "ibrnt",
      "long_bio": "**for your eyes only, will write a better description if selected**\n\nI've been developing for the web for the last decade or so. Worked as a freelancer for clients around the world. I have two failed startups behind me. Moved to Osijek to work with Farmeron where I took over the entire front-end process.",
      "image": "Need to take a decent photo first",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53db39431414141e04df2ab8"
    },
    "status": "accepted",
    "short_abstract": "The idea of this talk is to convey how important it is that we have our development environment as close to production as possible.",
    "long_abstract": "These days applications are getting more and more complex. It's becoming quite difficult to keep track of all the different components an application needs to function (a database, an AMQP, a web server, a document store...). It keeps getting harder and harder to setup new development environments and to bring new developers into the team. Stuff works on one dev machine but doesn't on others? Code breaks often when deployed to production even though all tests were passing and it worked on the dev machine?\n\nIn this talk I am going to show how to utilize light weight lxc containers using docker, and make your development process much more straightforward. How to share container images among your development team and be sure that everyone is running the exact same stack. Do all this without hogging too many resources, without the need for complex provisioning scripts and management systems. And above all else, how to do it fast!\n",
    "language": "English",
    "title": "Supercharge your development environment using Docker",
    "level": "Elementary",
    "submitted": {
      "sec": 1406845680,
      "usec": 0
    },
    "row_id": 97,
    "speaker": {
      "_id": {
        "$id": "53db39431414141e04df2ab7"
      },
      "github": "https://github.com/denibertovic",
      "short_bio": "Software Engineer. Python. Haskell. Linux. Devops.",
      "name": "Deni Bertovic",
      "twitter": "denibertovic",
      "long_bio": "Deni is a Software Engineer from Zagreb/Croatia, currently focusing mainly on Python, but enjoys learning about Clojure, Haskell and FP languages in general. Deni likes to do Sysadmin stuff with special interest in virtualization, continuous deployment and automating everything he can. When he's not hacking on open source, he spends most of his time happily coding away at GoodCode.io.\n\nInterested in continuous #deployment, #debian, #django, #docker, #functional programming, #haskell, #lxc, #python, #testing, #virtualization, #web.",
      "image": "http://pixbin.us/media/cache/8f/32/8f32f1045f3ebaf3d3468738d76ebde5.jpg",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53af0c0e1414141d48963a1d"
    },
    "short_abstract": "Building a high traffic website on the Expression Engine platform.",
    "language": "English",
    "title": "How I built news-bar.hr",
    "level": "Intermediate",
    "submitted": {
      "sec": 1403788470,
      "usec": 0
    },
    "row_id": 34,
    "long_abstract": "Building a large and high traffic website with no back-end experience as a designer presents a lot of challenges.\n\nThis talk will focus on the Expression Engine platform and how the News Bar website was built on it in 2 months. From EE's robust templating engine and member management to handling large traffic, caching, parse order and importing more than 2 thousand articles from the old site. We'll go over what went wrong, what went right and what lessons I learned as a small one man company.\n\nWe'll cover the challenges that face a single person when trying to build an entire site. We will also talk about the spin that was created for the relaunch, how some of the big portals were in on the joke and managed to provoke the government to respond on twitter.\n\nThe goal of the talk is to empower designers who have very little coding experience into building something much bigger with the help of great tools. I will cover the entire creative process from the design phase until the final server optimizations.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bb214141403187e96b6"
      },
      "github": "",
      "short_bio": "A passionate DJ, designer and gamer with too many interests.",
      "name": "Vladimir Bogdanić",
      "twitter": "dovla",
      "long_bio": "Started as a graphic designer doing flyers and posters for various music events I eventually got into DJing electronic music. At the same time I learned designing websites and started making them for festivals and parties, all centered around the same music scene. Graduated from TVZ in 2009 and got a job at Binom doing HTML/CSS work on big projects as well flash banner advertisements and logos. A year later I decided to go solo and after extensively touring all of Europe with a successful DJing career I decided it was time for something else. I started my own web design company Kontrast and decided to focus on making unique looking websites. After just a year the company already has a solid amount of clients and more coming every month.",
      "image": "http://www.kontrast-studio.com/dovla.png",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53d4d7676fc385384df66187"
    },
    "status": "accepted",
    "short_abstract": "Get the media to write about you web/mobile projects to get you more customers and motivate your team!\n\n[DISCLAIMER] I know it's not a tech talk but Tomislav Capan practically dared me to submit a proposal here :P :) https://www.facebook.com/groups/webdesignershr/permalink/743370219039767/",
    "long_abstract": "You plan, design and develope a great web project or mobile app - launch it or deliver it to your client. Would be nice to see it in the media, right? To attract new clients, motivate your team maybe? Blah, those journalists know nothing. Well, here's some practical tips to get them writing about your portfolio of projects!",
    "language": "English",
    "title": "Practical PR for web pros: Don't like the media? Use it to your advantage!",
    "level": "Elementary",
    "submitted": {
      "sec": 1405433691,
      "usec": 0
    },
    "row_id": 64,
    "speaker": {
      "_id": {
        "$id": "53d4d7676fc385384df66186"
      },
      "github": "",
      "short_bio": "Founder of leading regional tech blog Netokracija.com and mentor at Seedcamp/Hub:raum/Eleven... ",
      "name": "Ivan Brezak Brkan",
      "twitter": "ivanbrezakbrkan",
      "long_bio": "As the founder of Netokracija.com, I've written about numerous web and mobile projects, as well as startups over more than 5 years. As a former web designer as well as agency founder, I know how hard it is to get attention from the media for client projects as well as startups. From my experience at Netokracija, Freelance Switch and Techcrunch, I'd like to give back to the community with some tips.",
      "image": "https://pbs.twimg.com/profile_images/484671965110624257/2roUyBF3.jpeg",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53db39431414141e04df2ab4"
    },
    "status": "accepted",
    "short_abstract": "Is it possible that JS - as a first class citizen of Software Development - went mad and want to conquer our planet and kill all the humans?",
    "long_abstract": "Is this going for the page? I would like to describe what I'll talk about just for the organizers.\n\nI made a lot of neural networking experiments with JS, mostly in Node. I want to explain people how Artificial Intelligence works, how it can be used in games, in robots, and in creating code & design. You can threat this topic as an introduction to AI & genetic algorithms with examples in JavaScript. If you will like it, and need longer description than this one for the page, I can prepare something, but I think that this 140 chars description is mysterious enough to make interest among the audience. Thanks.\nMichał",
    "language": "English",
    "title": "JS, JS, are you mad?",
    "level": "Intermediate",
    "submitted": {
      "sec": 1406819023,
      "usec": 0
    },
    "row_id": 95,
    "speaker": {
      "_id": {
        "$id": "53db39431414141e04df2ab3"
      },
      "github": "michalbe",
      "short_bio": "Hi, I'm Michał. I'm 174, white (caucasian) male with glasses (just recently). I like pizza & beer.",
      "name": "Michał Budzyński",
      "twitter": "michalbe",
      "long_bio": "Michal is former Karate (1 kyu) & MMA fighter and Star Alliance Gold Senator. He loves subway systems & TV shows and collect ancient roman coins. Time to time he codes <github.com/michalbe>, tweets <@michalbe> and blogs <michalbe.blogspot.com>. As a former mercenary in Mozilla FirefoxOS army & now volunteer, he is a front line soldier in war for the best mobile operating system.",
      "image": "https://avatars2.githubusercontent.com/u/347657?v=1&s=460",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53b320ab141414136846868f"
    },
    "short_abstract": "How do you develop a 3D flight simulator for an experimental drone? Take an open source gaming engine, hone in a lot of Python, and here is your flying drone!",
    "language": "English",
    "title": "Gaming a drone simulator",
    "level": "Elementary",
    "submitted": {
      "sec": 1404238539,
      "usec": 0
    },
    "row_id": 56,
    "long_abstract": "This simulator was developed for an EU research project: AIRobots. \nHow do you tie the real drone control system, based on Simulink, to Blender, in order to create a realistic 3D simulation of the control behaviour? Can you really use the physics engine of Blender to compute the behaviour? Where did we stop? What did we achieve? During this talk, I'll walk you through the tools and libraries required for this project, its many pitfalls and its successes. ",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53b320ab141414136846868e"
      },
      "github": "acbellini",
      "short_bio": "If being curious, enjoying new technologies, loving to study and tear apart tools and architecture means being young, then I'm a very young engineer :)",
      "name": "Anna Chiara Bellini",
      "twitter": "annachiara_b",
      "long_bio": "With almost twenty years of experience in development, I have been working for any kind of project and any size of company, From micro-startups with crazy hours and no rules to large organizations with hyper-detailed specs. In between I've worked on several research projects and I've taught a lot.\nRight now I'm working almost exclusively as a freelancer and trying to connect with as many developers as possible. My current goal is to become proficient in data science. ",
      "image": "http://2014.webcampzg.org/images/speakers/anna-chiara-bellini.png",
      "shirt": "Female M"
    }
  },
  {
    "_id": {
      "$id": "53d4d7676fc385384df66185"
    },
    "status": "accepted",
    "short_abstract": "We'll describe how to use only your HTML and CSS knowledge to build powerful Web Shop for your customer, using our own BizzyBeeShop platform.",
    "long_abstract": "BizzyBeeShop platform is built on MojaTrgovina.Net E-Commerce system, and allows a web designer/developer to quickly and simply build Web Shop for a customer.\n\nWe at MojaTrgovina.Net are using the same system for years, and we built many E-Commerce systems, practically the same way we allow web designers to build now.\n\nBizzyBeeShop platform will show how a domestic/croatian web shop can be built using just HTML and CSS, and configuring server-side controls the way the designer and customer want to.\n\nYou can also use javascript, and some of the newest technologies available today on your web shop.\n\nYou will have at your disposal large number of functionalities that our platform supports, along with credit card payments, shipping costs, promocode discounts and such.\n\nWe will demonstrate how a designer or developer can change entire web shop look and feel using just CSS/HTML changes. Also using advanced CSS we will show how the same web shop can become responsive to be used on mobile devices.\n",
    "language": "English",
    "title": "Design Web shops using croatian BizzyBeeShop platform",
    "level": "Intermediate",
    "submitted": {
      "sec": 1405385926,
      "usec": 0
    },
    "row_id": 63,
    "speaker": {
      "_id": {
        "$id": "53d4d7676fc385384df66184"
      },
      "github": "",
      "short_bio": "Siniša Cvjetković is best described as the drummer in IT business. 20 years of IT experience, and some less of playing drums.",
      "name": "Siniša Cvjetković",
      "twitter": "",
      "long_bio": "Siniša has been in IT business for about 20 years. Working in greatest Croatian companies such as IN2, S&T, King-ICT he’s been primarily interested in projects of business integration and application architecture.\n\nIn late 2007 started the coolest experience with founding his own company Sistrum Ltd., better known as Moja-Trgovina.Net (My-Web-Store.net). Since the start the company main focus is E-Commerce and projects in that field.\n\nGreat E-Commerce experience on various projects drive us (as company) forward in new adventures, making great new products. One of which is the new BizzyBeeShop platform for web shop development and design. Very proud of that and we’re sure it will be a great success.",
      "image": "https://fbcdn-profile-a.akamaihd.net/hprofile-ak-xaf1/t1.0-1/c0.0.160.160/p160x160/25812_1345698997328_380825_n.jpg",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53d4d7686fc385384df66189"
    },
    "status": "accepted",
    "short_abstract": "Learn how Etsy designs and builds responsive emails that provide a consistent experience for readers and look great across desktop and mobile email clients. \n",
    "long_abstract": "At Etsy, our tracking metrics tell us that more than 50% of our emails are opened on mobile devices. This means we need to rethink the way we design and build our emails to accommodate a growing list of multi-width devices and their distinct rendering quirks.\n\nWe want our readers to have the best possible experience when they view our emails, so we’re experimenting with new techniques that move away from desktop-orientated, fixed-width designs and incorporate more flexible layouts that look good on every client, including iPhones, iPads, Android, Webmail and more.\n\nWe’ll walk you through a recent case study whereby 'building specifically for mobile' influenced the design and development decisions we ultimately made. We'll also highlight the value of a simple, two-column layout and show you ways to code for mobile to achieve pixel perfect emails that look great across a multitude of phones, tablets and desktop devices.",
    "language": "English",
    "title": "Responsive Emails, from Design to Development",
    "level": "Intermediate",
    "submitted": {
      "sec": 1405518760,
      "usec": 0
    },
    "row_id": 65,
    "speaker": {
      "_id": {
        "$id": "53d4d7676fc385384df66188"
      },
      "github": "mdnetto",
      "short_bio": "Michelle D'Netto is a software engineer and email crafter at Etsy. She lives mostly in her inbox and loves coding up new emails designed by her talented co-workers.\n",
      "name": "Michelle D'Netto",
      "twitter": "mdnetto",
      "long_bio": "Michelle D’Netto is a software engineer who has been working at Etsy for four years. She lives in her inbox while developing beautifully designed marketing emails that showcase an assortment of hand-made items featured on Etsy.com.\n\nMichelle is a true maker. She makes jewelry in her spare time often experiments with glass, clay and other mediums.\n\nMichelle works and plays in Brooklyn, New York.",
      "image": "https://fbcdn-sphotos-a-a.akamaihd.net/hphotos-ak-xap1/t1.0-9/p417x417/65567_10151267374816400_1805750388_n.jpg",
      "shirt": "Female M"
    }
  },
  {
    "_id": {
      "$id": "53b1d3cd141414115c7c9afd"
    },
    "short_abstract": "REST building blocks in service of cloud infrastructure provider",
    "language": "English",
    "title": "REST on (y)our shoulders",
    "level": "Intermediate",
    "submitted": {
      "sec": 1404130657,
      "usec": 0
    },
    "row_id": 43,
    "long_abstract": "Some years ago we got together and rapidly wrote some crazy code. It started as a web front-end but really encapsulated all the business logic into one big monolithic web app. But by leveraging the Django framework we got it built and online, and it actually kind of worked good. But time passed, and as we had new ideas it looked harder to implement new features and hard to maintain and test. So at some point (for better or worse) we decided to throw everything away and start fresh. This time it would be: modular, built upon small micro-services, that could communicate together RESTfully. The UI would also speak the same language and be cleanly separated from the business logic. Did we do it? What did we learn? What went wrong?\n",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53b1d3cd141414115c7c9afc"
      },
      "github": "mario",
      "short_bio": "A (master)chef, a business guy, and a random developer",
      "name": "Mario Danic",
      "twitter": "mdjanic",
      "long_bio": "One of the first community managers in the world, founded and maintained Slicehost community, a pioneer in the cloud space later sold to Rackspace.\n\nProbably the youngest mentor from Croatia in Google Summer of Code program, doing it even before being a student myself.\n\nStarted and still running a profitable company with a guy located across the world from me whom I've never met, challenging the big folks and delivering what only a few bigger companies managed to deliver.\n\nBeing a big believer in open source, I founded and still continue to run projects used by millions of people worldwide. (like Gnomebaker and Libburnia)\n",
      "image": "https://avatars2.githubusercontent.com/u/5810?s=460",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53af0c091414141d48963a09"
    },
    "short_abstract": "Do mobile developers know enough about security of devices they write software for?",
    "language": "English",
    "title": "Android security model ",
    "level": "Intermediate",
    "submitted": {
      "sec": 1401747600,
      "usec": 0
    },
    "row_id": 14,
    "long_abstract": "Although it grew from Unix roots, and while it does use Linux kernel, Android is an operating system unlike any of its predecesors. The security system implemented in Android stems from the classical Unix security system and use it (although in a warped way), but there are other, more modern security models implemented in Android that are pretty alien to Unix systems of yesteryear. On top of that, there's the security model of virtual machine to make things even more complicated. \n\nDo developers have to worry about the security of the underlying operating system? Do they even have to worry about the security of their own applications? What could possibly go wrong?",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bad14141403187e96a6"
      },
      "github": "",
      "short_bio": "An expert IT professional specialising in ICT infrastructure, Open Source and systems with an emphasis on interoperability and security.\n",
      "name": "Radoslav Dejanović",
      "twitter": "DejanovicR",
      "long_bio": "A child of 8-bit revolution, I'm still impressed with computers and what can be done with them. I spent years as a journalist, tackled the odds with a team of incredible people at a young startup named Vipnet, moved on to become Senior Associate to Mayor's Office in Zagreb and finally started my own business 12 years ago. Passionate about Free Software and aspects of ICT security, I always seek new challenges, things to learn and great people to learn from. ",
      "image": "can I attach one in the email?",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53b1d3ce141414115c7c9b00"
    },
    "short_abstract": "Why debugging is an essential skill for writing code.",
    "language": "English",
    "title": "Debugging clever code",
    "level": "Intermediate",
    "submitted": {
      "sec": 1404135294,
      "usec": 0
    },
    "row_id": 45,
    "long_abstract": "Benefits of debugging, how does it affect your productivity.\nEncouraging developers to continue setup debug tools, despite the configuration difficulty.\nIntroduction and comparison of a couple debug tools.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53b1d3cd141414115c7c9aff"
      },
      "github": "martomo",
      "short_bio": "A creative, versatile, motivated and enthusiastic Developer, always looking for new challenges.",
      "name": "Martijn Dijkhuizen",
      "twitter": "",
      "long_bio": "I am a Software Developer, currently employed at Celtra, part of the team which focuses on building Ads within AdCreator.\nPrior to that I maintained and developed video on demand application VOYO for ProPlus, the leading media company in Slovenia.\nNext to that I'm looking for ways on how to improve my workflow, such as the Xdebug Client package for Sublime Text.",
      "image": "http://martijn-dijkhuizen.nl/profile.jpg",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53af0c0b1414141d48963a14"
    },
    "short_abstract": "Shaping REST API responses with advanced query algebra.",
    "language": "English",
    "title": "Beyond GET",
    "level": "Intermediate",
    "submitted": {
      "sec": 1402846797,
      "usec": 0
    },
    "row_id": 25,
    "long_abstract": "Currently, REST APIs give us little control over the structure of data that is to be returned. We can fetch a list of items, for example articles, but we don't have control over embedding nested objects, such as comments, or filtering and ordering results by certain attributes. With standardized query logic passed via URL params, clients are able to shape results according to their needs.\n\nThe example query below would result in a list of articles ordered by creation date, whose title contains \"REST\" with embedded author objects:\n\n```\nGET /articles?title=%REST%&embed=author&order=created_at:desc\n```\n\nThis talk will give a proposal of a standardized query algebra, which various famous APIs already partially implement using differing syntaxes and feature subsets.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bb014141403187e96ae"
      },
      "github": "vdragsic",
      "short_bio": "Currently stuck in backend land with Ruby in hand and functional programming on mind.",
      "name": "Veljko Dragšić",
      "twitter": "vdragsic",
      "long_bio": "I'm software engineer living in Zagreb, Croatia, with several years of experience in software development and system administration.\n\nI currently work at Bitovi on building data aggregation, REST API platform in Ruby. Other work is related on frontend development in CanJs.\n\nPrevious experience would include Linux administration, network stack, PostgreSQL, C, web development in Python/Django and parallel computing in MPI and OpenCL.\n\nI'm passionate about functional programming and would consider myself as Haskell newbie.",
      "image": "http://2014.webcampzg.org/images/speakers/veljko-dragasic.png",
      "shirt": "Male S"
    }
  },
  {
    "_id": {
      "$id": "53db39441414141e04df2abc"
    },
    "status": "accepted",
    "short_abstract": "Selenium scraping of other people's fun and profit",
    "long_abstract": "Selenium is neat. It allows you to automate system tests and yadda yadda acceptance yadda...\n\nYawn. Real developers don't automate tests, they automate bank scrapes!\nGrabbing account balances on Monday, transferring money on Tuesday, that's how we roll.\n\n~ A tongue-in-cheek presentation about the exercise in futility of scraping net banking interfaces. ~\n\nWe'll show you some of the more absurd measures banks deploy to guard their security.\nSecurity? You mean obscurity? Why would a bank need an API in 2014, hell we only just switched from Cobol on Cogs.\n\nDealing with an ever-changing canvas, a torrent of banners and \"new offers\" on a bank interface can be stressful.\nWe'll show you the behemoth of a stack that was required to deal with a couple hundred integrated banks.\nConcretely, a chimera of Scala, PHP, Java, C#, JS and a lot of WD-40 that makes the thing actually work.\n\nYeah, WebDriver Firefox _is_ neat, but CasperJS is spooky fast. So, let's combine the two!\nEverything may crash ~ so arm yourselves with exceptional exception handling ~ or you may just want to pivot to manually scanning printouts.",
    "language": "English",
    "title": "Man in the middle attack on banks",
    "level": "Intermediate",
    "submitted": {
      "sec": 1406848363,
      "usec": 0
    },
    "row_id": 99,
    "speaker": {
      "_id": {
        "$id": "53db39441414141e04df2abb"
      },
      "github": "melezov",
      "short_bio": "Loves to procrastinate. Unless it's an interesting problem. Then it's urgent.",
      "name": "Marko Elezović",
      "twitter": "melezov",
      "long_bio": "Marko Elezović is the tech lead of Instantor AB, primarily dealing with cash flow credit risk assessments.\n\nIn a loving relationship with new, disruptive and buzzword compliant technologies.\nHaving recently organized the HRScala meetup group, he is trying to rally fans of alternative JVM languages under its flag.\n\nCEO of Element and DSL Platform.\n",
      "image": "http://2013.webcampzg.org/wp-content/uploads/2013/09/marko_elezovic-200x200.jpg",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53d4d7656fc385384df6617d"
    },
    "status": "accepted",
    "short_abstract": "Learn about what tools and processes you can put in place to aid you in building a responsive site.",
    "long_abstract": "Responsive design has enabled us to build websites that works well across all devices however this has come at the cost of increasing the amount of time we spent developing our sites. This talk will explore ways in which we can improve our workflow with a variety of tools such as Grunt and Gulp that have been developed in the past couple of years. The aim being that as developers we should be able to save time in our workflow to enable us to concentrate on building awesome responsive experiences.",
    "language": "English",
    "title": "Developer Workflow in a Responsive World",
    "level": "Intermediate",
    "submitted": {
      "sec": 1405263853,
      "usec": 0
    },
    "row_id": 58,
    "speaker": {
      "_id": {
        "$id": "53d4d7656fc385384df6617c"
      },
      "github": "jonathan-fielding",
      "short_bio": "Jonathan Fielding works in the web industry based in England, working on a number of projects related to furthering responsive design",
      "name": "Jonathan Fielding",
      "twitter": "jonthanfielding",
      "long_bio": "Jonathan is web developer working in London, author of Beginning Responsive Design with HTML5 and CSS3 and contributor to open source. Projects that he has worked on include SimpleStateManager, Gitissu.es, ResponsiveJavascript.com and Doccy. Client wise he currently is contracting with the guys at Beamly helping them build an awesome Responsive Social platform for the web, aside from this he has worked with clients such as Sony, BT, British Gas and Virgin.",
      "image": "https://pbs.twimg.com/profile_images/3582817421/bb751558c5cd61b57cac7a3528d15eff.jpeg",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53db39421414141e04df2aae"
    },
    "status": "accepted",
    "short_abstract": "The talk describes how Web technologies can help us design more creative and interactive data visualizations.",
    "long_abstract": "Browsers and associated technologies grow more and more powerful every day, but so do our needs and wishes. Connections, interactions, trends and hot topics... are pie charts, histograms or even line charts suitable to represent any of those? We need something more powerful and visually appealing. Oh, and let's make things clear right away – users like their images big, bright and shiny (and containing cats).\n\nJavascript, combined with SVG, WebGL, and the like, makes it easy to visualize data in an eye-catching and interactive way. This talk introduces some interesting ideas, techniques and technologies that can make users' eye pop.\n\nIn order to make the dull theory more compelling, an example is introduced to better explain the presented ideas. Also, an actual example makes it easier to pinpoint the downsides one might encounter during the whole process.",
    "language": "English",
    "title": "Visualizing data on the Web",
    "level": "Elementary",
    "submitted": {
      "sec": 1406772857,
      "usec": 0
    },
    "row_id": 92,
    "speaker": {
      "_id": {
        "$id": "53db39421414141e04df2aad"
      },
      "github": "",
      "short_bio": "A young software enthusiast interested in a wide range of software and computer science related topics.",
      "name": "Hrvoje Gazibara",
      "twitter": "hgazibara",
      "long_bio": "A recent university graduate, most recently contacted by AVL on creating tools for data post-processing and evaluation. Highly interested in software and computer science related topics, with a newly discovered passion for functional languages and underlying theory.",
      "image": "http://bit.ly/1nKtjUp",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53d4d7676fc385384df66183"
    },
    "status": "accepted",
    "short_abstract": "Want to use the new cool Java SE 8 features in your enterprise project? Then this session is something for you.",
    "long_abstract": "Java EE 7 has been around for a while and some of the application servers are beginning to support Java SE 8. This session will take you through some of the new Java SE 8 features that are particularly well suited for Java EE 7 applications. The focus will be on increasing performance and developer productivity as well as reducing the complexity of the code. ",
    "language": "English",
    "title": "Java 8 for Enterprise Developers",
    "level": "Intermediate",
    "submitted": {
      "sec": 1405348878,
      "usec": 0
    },
    "row_id": 62,
    "speaker": {
      "_id": {
        "$id": "53d4d7666fc385384df66181"
      },
      "github": "ivargrimstad",
      "short_bio": "Ivar Grimstad is an experienced software architect with a strong focus on Enterprise Java. He is a frequent speaker at conferences, locally as well as internationally.",
      "name": "Ivar Grimstad",
      "twitter": "ivar_grimstad",
      "long_bio": "Ivar have been working with Java since the beginning and have over the years tried out everything from lightweight mobile applications to large scale enterprise applications. His experience covers all aspects of designing architectures based on a variety of technologies including standard Java EE as well as more lightweight frameworks such as Spring and a variety of open source products. \n\nIvar is always focusing on quality and on using the right tools and technologies for the right task to optimize the software development process. \n",
      "image": "http://www.agilejava.eu/wp-content/uploads/2014/07/ivar_grimstad_600_600.png",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53d4d7666fc385384df66182"
    },
    "status": "accepted",
    "short_abstract": "Problems choosing between Java EE and Spring? Or do you want to use both in combination? Then this session is something for you.",
    "long_abstract": "In this session I will go through the similarities and differences between Spring 4 and Java EE 7. I will go through what you need to consider to configure and combine the two approaches. In the demo part of the presentation I will show how to integrate existing Spring 4 components into a Java EE 7 application. And as if that is not enough, I will also do it the other way around, that is to integrate existing Java EE 7 components into a Spring 4 application.\n\nStrengths and weaknesses with the approaches will then be explored and lessons learned summarized.\n",
    "language": "English",
    "title": "Spring 4, Java EE 7 or Both?",
    "level": "Intermediate",
    "submitted": {
      "sec": 1405342024,
      "usec": 0
    },
    "row_id": 61,
    "speaker": {
      "_id": {
        "$id": "53d4d7666fc385384df66181"
      },
      "github": "ivargrimstad",
      "short_bio": "Ivar Grimstad is an experienced software architect with a strong focus on Enterprise Java. He is a frequent speaker at conferences, locally as well as internationally.",
      "name": "Ivar Grimstad",
      "twitter": "ivar_grimstad",
      "long_bio": "Ivar have been working with Java since the beginning and have over the years tried out everything from lightweight mobile applications to large scale enterprise applications. His experience covers all aspects of designing architectures based on a variety of technologies including standard Java EE as well as more lightweight frameworks such as Spring and a variety of open source products. \n\nIvar is always focusing on quality and on using the right tools and technologies for the right task to optimize the software development process. \n",
      "image": "http://www.agilejava.eu/wp-content/uploads/2014/07/ivar_grimstad_600_600.png",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53af0c0c1414141d48963a17"
    },
    "short_abstract": "AngularJS is drawing attention today, and this talk shows a couple of good reasons why you should be excited about it too.",
    "language": "English",
    "title": "Make the fronend a better place with AngularJS",
    "level": "Intermediate",
    "submitted": {
      "sec": 1403088191,
      "usec": 0
    },
    "row_id": 28,
    "long_abstract": "AngularJS helps you bringing structure into your JavaScript application. It has a lot to offer - more than other frameworks. It uses generally accepted concepts like Dependency Injection and lets you actually separate content from logic. This talk shows you just the Best from AngularJS. JavaScript knowledge is recommended for this talk.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bb014141403187e96b0"
      },
      "github": "grobmeier",
      "short_bio": "I am a german software developer and Apache Software Foundation hacker, focussing on web apps. At the moment, I enjoy dynamic languages.",
      "name": "Christian Grobmeier",
      "twitter": "grobmeier",
      "long_bio": "Christian Grobmeier is a developer, author and occasional trainer focusing on web technologies. Grobmeier currently works with JavaScript/AngularJS, PHP, Java. While he is available for hire, Grobmeier dedicates a lot of his time to his own projects like \"Time & Bill\".\nRecently he self-published \"The Zen Programmer\", a book explaining how programmers can use Zen to reduce their stress level.",
      "image": "http://images.grobmeier.de/grobmeier-400x400.png",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53af0c0c1414141d48963a16"
    },
    "short_abstract": "Apache Cordova helps you to bring your web application to mobile platforms - this talk shows you some chances and pitfalls.",
    "language": "English",
    "title": "Go mobile with Apache Cordova",
    "level": "Elementary",
    "submitted": {
      "sec": 1403087727,
      "usec": 0
    },
    "row_id": 27,
    "long_abstract": "Apache Cordova is just a container for your HTML5/JS/CSS app. It works best with ajax driven single page applications. It's actually very easy to start creating apps for Android, iPhone and others and put them on their respective app stores. However its not only gold what what shines: there are also drawbacks compared to native applications. This talk will show you how you can build an easy app and then explains a few problems you need to solve, when the first excitement is gone.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bb014141403187e96b0"
      },
      "github": "grobmeier",
      "short_bio": "I am a german software developer and Apache Software Foundation hacker, focussing on web apps. At the moment, I enjoy dynamic languages.",
      "name": "Christian Grobmeier",
      "twitter": "grobmeier",
      "long_bio": "Christian Grobmeier is a developer, author and occasional trainer focusing on web technologies. Grobmeier currently works with JavaScript/AngularJS, PHP, Java. While he is available for hire, Grobmeier dedicates a lot of his time to his own projects like \"Time & Bill\".\nRecently he self-published \"The Zen Programmer\", a book explaining how programmers can use Zen to reduce their stress level.",
      "image": "http://images.grobmeier.de/grobmeier-400x400.png",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53d8d49f6fc3853a3b4ff4e3"
    },
    "status": "accepted",
    "short_abstract": "This session will prepare you for the future of the web platform by explaining Web Components.Write less boilerplate and be more productive.",
    "long_abstract": "Web components are purely about developer productivity. Shadow DOM, templates, custom elements, and HTML Imports, web components cast, allow us to finally create reusable, shareable components so we can write less boilerplate code and target every platform by using the next generation of the web platform. The goal in this session is to help you realize tomorrow's web platform today.",
    "language": "English",
    "title": "Web Components",
    "level": "Intermediate",
    "submitted": {
      "sec": 1406713205,
      "usec": 0
    },
    "row_id": 89,
    "speaker": {
      "_id": {
        "$id": "53d8d49e6fc3853a3b4ff4e2"
      },
      "github": "matijagrcic",
      "short_bio": "MCSD Web Apps, MCTS,  C# programmer with a keen interest in all things code. {CODE IT's FUN }",
      "name": "Matija Grčić",
      "twitter": "matijagrcic",
      "long_bio": "Matija Grčić is an engineer at University Computing Centre Srce, FOSS fan, blogger and speaker. Matija has written a lot of web applications, optimized mobile web sites and various APIs. Fascinated by the way mobile technology has changed things, he now spends a lot of time thinking about the future of the web so these days, his activities are mostly on software craftsmanship around HTML5, JavaScript, and other web technologies.",
      "image": "https://www.dropbox.com/s/9595qd51aor7969/profile_matija_grcic.png",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53af0c0d1414141d48963a1b"
    },
    "short_abstract": "Vagrant let you build development environments that are portable and reproducible",
    "language": "English",
    "title": "Vagrant to the rescue",
    "level": "Elementary",
    "submitted": {
      "sec": 1403558813,
      "usec": 0
    },
    "row_id": 32,
    "long_abstract": "Many developers know the pain of setting up a development machine and share the setup with the team - Putting the same folders in the same place, keeping configurations in sync and managing external dependencies. Vagrant solves this problem by creating a development environment inside a virtual machine and making it easy to share with other developers. \nWithin this talk, I'll take the audience on a trip from a time where everybody would install stuff on localhost until the software starts working to a land where the environment one develops in mirrors the production environment as closely as possible without changing the laptop/pc of the developer. I'll talk about devops and configuration management briefly and show how one can get started with vagrant.\nAfter this talk, the audience knows what problems vagrant solves and how to get started.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bb214141403187e96b4"
      },
      "github": "Sgoettschkes",
      "short_bio": "#music #bodymod #symfony #agile #devops",
      "name": "Sebastian Göttschkes",
      "twitter": "Sgoettschkes",
      "long_bio": "I co-founded my first company, Pictureplix, while still in university. Being responsible for the API that connected frontends with our production backend, I learned how to scale stuff and how important it is to develop with a stack that is close to the production environment. I joined wogibtswas.at, a location based bargain hunting plattform in mid 2013 and try to guide a team of software developers through the fog of business requirements. I am using PHP and Python in my free time for various spare projects. All of them run with vagrant of course.",
      "image": "http://2014.webcampzg.org/images/speakers/sebastian-gottschkes.png",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53af0c0d1414141d48963a1c"
    },
    "short_abstract": "Real time bidirectional communication in web browsers",
    "language": "English",
    "title": "Real Time Communication In Browsers",
    "level": "Elementary",
    "submitted": {
      "sec": 1403705673,
      "usec": 0
    },
    "row_id": 33,
    "long_abstract": "Challenging todays problems in real time communication in web browsers. What technologies and frameworks can we use, what is supported in which browser and what we can all use it for",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bb214141403187e96b5"
      },
      "github": "",
      "short_bio": "I've been developing for years now",
      "name": "Fatos Hoti",
      "twitter": "",
      "long_bio": "In the last 6 years, since I started working in code development I saw A LOT of things change and I had the opportunity to work on a lot of different projects and project types. Now an almost 30 year old man I remember that I started as a Software Tester at MBU ltd. and ended up as a Lead Developer on a project currently being developed at Degordian ltd.",
      "image": "http://www.degordian.com/static/img/team/fatos_hoti.jpg",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53af0c0f1414141d48963a22"
    },
    "short_abstract": "Did you ever wonder how testing at Google looks like? What tools we use to help us out and how do we measure and act on test coverage?\n",
    "language": "English",
    "title": "Measuring test coverage at Google",
    "level": "Intermediate",
    "submitted": {
      "sec": 1403971939,
      "usec": 0
    },
    "row_id": 39,
    "long_abstract": "A short introduction on the way Google tests it's products, with a short overview of the development process and what tools we use.\n\nThis will be followed by a more detailed presentation of how automated testing is performed during development. This part of the presentation will especially focus on use of code coverage measurement and how we use code coverage to improve code quality and engineering productivity.\n\nIn the end, I will present the vast amount of coverage data, spanning more than 100.000 commits, we have collected and some more widely applicable conclusions we have reached.\n",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bb314141403187e96ba"
      },
      "github": "ivankovic",
      "short_bio": "Wizard Hacker",
      "name": "Marko Ivanković",
      "twitter": "",
      "long_bio": "Senior Software Engineer in Test at Google. Tech lead in the Ads Engineering Productivity group in Zurich. Specializing in test coverage and random data generation.\n\nMSc of Computer Science at FER - University of Zagreb.\n",
      "image": "http://2014.webcampzg.org/images/speakers/marko-ivankovic.png",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53af0c091414141d48963a0b"
    },
    "short_abstract": "I will talk about my experience as WordPress plugin in-development tester, a work I do remotely for a world-wide distributed company.",
    "language": "English",
    "title": "In-development WordPress plugin testing and remote work",
    "level": "Elementary",
    "submitted": {
      "sec": 1401896177,
      "usec": 0
    },
    "row_id": 16,
    "long_abstract": "I work for the OnTheGoSystems company, which develops different plugins for the Wordpress platform. The company is currently best known for its plugin called “WPML” which gives WordPress a great multi-language functionality on many different levels. I will talk about my experience as an in-development tester which means working closely with developers to test things as they are being developed and also organising and managing the usability tests with common users. All of this contributes to publishing polished plugins with better usability. I will talk about the tools I use and the workflow of the testing. Finally, I do my work remotely from home which is also something quite interesting and different from what most of people are still used to. Therefore I will also talk about what this means, how it works and what are the most important aspects of remote work for people that are looking for a remote working jobs, as well as the ones who are thinking of hiring people to work remotely for them.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bae14141403187e96a7"
      },
      "github": "",
      "short_bio": "I am a web developer that works as an in-development tester. At night I transform into a folk-rock singer-songwriter beast.",
      "name": "Dario Jazbec Hrvatin",
      "twitter": "",
      "long_bio": "I am a web developer born in Croatia but moved to Slovenia 7 years ago after marrying my Slovenian wife. I worked for some years as a freelancer and had a first employment for the independent cultural youth centre called Pekarna in Maribor. After that experience I moved to the more commercial sector and worked for 4 years at Mediamix, a very known (it won 2 Cannes Lions for example) marketing agency from Maribor. I worked there as the lead web developer. When I got a chance to work for OnTheGoSystems, a company that produces some of my favourite WordPress plugins I jumped to the opportunity and this is my current employment. It is quite different from my previous jobs but I enjoy it very much since it’s very dynamic, interesting and joyful. \nI love spending free time with my wife and our chihuahua, making trips to nature and just having fun. Rest of my free time I devote to working with my band Helika, in which I am the main author, singer and guitarist.",
      "image": "https://dl.dropboxusercontent.com/u/32672435/dario_jazbec_hrvatin.jpg",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53af0c0b1414141d48963a13"
    },
    "short_abstract": "I will talk about how to implement HTML based IPTV, what elements you need, and some specifics of implementing HTML for IPTV.",
    "language": "Croatian",
    "title": "Web Based IPTV",
    "level": "Elementary",
    "submitted": {
      "sec": 1402537562,
      "usec": 0
    },
    "row_id": 24,
    "long_abstract": "I will describe basics of IPTV, what you need to implement it, how to implement it, specifics of HTML and javascript for different vendors of Set Top Boxes.\n",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bb014141403187e96ad"
      },
      "github": "",
      "short_bio": "Head of IT department at  Faculty of Kinesiology, University of Zagreb.\nRuby On Rails, PHP, JavaScript developer, Linux admin, network admin...",
      "name": "Dorijan Jelinčić",
      "twitter": "",
      "long_bio": "Head of IT department at  Faculty of Kinesiology, University of Zagreb.\nRuby On Rails, PHP, JavaScript developer, Linux admin, network admin...",
      "image": "http://www.kif.unizg.hr/images/users_profiles/f504a4867deb6b5848ce347baf584b681380834336.jpg",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53b1d3ce141414115c7c9b04"
    },
    "short_abstract": "Ensuring data consistency and mutation accountability when aggregating differing data streams, while still making that data your own.",
    "language": "English",
    "title": "Aggregating data consistently and accountably",
    "level": "Advanced",
    "submitted": {
      "sec": 1404138998,
      "usec": 0
    },
    "row_id": 47,
    "long_abstract": "Imagine you're dealing with social media networks. You're fetching a status from Facebook and building an entity of your own out of it. After a while, a user of your system wants to edit that entity, for example, assign some meta-data to it. Meanwhile, you decide that a tweet coming in from Twitter represents essentially the same entity as that Facebook post you already have, and you want to modify your entity with this new information. With all these differing and concurrent data streams, how do you know who updated what, and what's the real state of data?\n\nIn this talk, an abstraction layer that was built to solve the described problem will be presented. It's called an append-only architecture. It stores each new data atom separately and incrementally builds entities as new atoms come in. Consequently, it enforces consistency and provides accountability by replaying all data mutations and verifying that the data should indeed have the state that it has.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53b1d3ce141414115c7c9b03"
      },
      "github": "neektza",
      "short_bio": "PLT guy, always interested in learning (cool) new stuff and working on challenging projects.",
      "name": "Nikica Jokić",
      "twitter": "neektza",
      "long_bio": "Software developer, working for @bitovi. I dig programming languages, all kinds.",
      "image": "http://2014.webcampzg.org/images/speakers/nikica-jokic.png",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53db39441414141e04df2abe"
    },
    "status": "accepted",
    "short_abstract": "Designer who self-consciously bicycles to work should be aware about the consequences of his/hers design or code on the environment in the future.",
    "long_abstract": "Every website has its own carbon footprint, why don’t we make it less as possible and still create good design? Web designers and developers, use technology to create flexible designs with specific visual, interactive, and user experience features. Once the design is complete, it runs as a virtual machine built from HTML, CSS and JavaScript. Efficiency is a priority at all levels, from art to code. Sustainable web process is minimising environmental impact and maximising value for clients and audience, but also follows strategies for site creation and maintenance so they can serve their purpose today and in the future. Sustainability and good design are compatible.",
    "language": "English",
    "title": "Sustainable web design",
    "level": "Intermediate",
    "submitted": {
      "sec": 1406860831,
      "usec": 0
    },
    "row_id": 100,
    "speaker": {
      "_id": {
        "$id": "53db39441414141e04df2abd"
      },
      "github": "",
      "short_bio": "Designer with over eight years of professional experience in the design industry. Organised, time saver, hungry for art and new knowledge. Live and work in Zagreb.",
      "name": "Martina Jović",
      "twitter": "martina_jovic",
      "long_bio": "My name is Martina Jović, Master of Science in Graphic Technology, studied at University of Zagreb - Faculty of Graphic Arts. I have worked in Effectiva studio as co-owner and designer, and now I’m freelance - graphic and digital designer mostly work for DOOR - Society for Sustainable Design Development and Avalon. My professional interests are building highly efficient web sites, applications or media products which will be the best for audience and owners guided by the principles of the sustainable design.",
      "image": "http://localenergydialogue.net/wp-content/themes/Revera-child/images/martina_jovic.png",
      "shirt": "Female M"
    }
  },
  {
    "_id": {
      "$id": "53af0c071414141d48963a03"
    },
    "short_abstract": "Implementing highly concurrent backend systems using actor model.",
    "language": "English",
    "title": "Thinking in actors",
    "level": "Advanced",
    "submitted": {
      "sec": 1401279570,
      "usec": 0
    },
    "row_id": 8,
    "long_abstract": "This talk will present a medium-level design of the live betting system I've built for a sport betting company. The aim is to illustrate how can we use Elixir/Erlang powered actors to push frequent updates to a large number of connected users in real-time.\n\nAssuming an audience of experienced backend developers, the talk will provide a bare minimum of theory, and then focus on presenting various decisions made in the system, starting from accepting the data from the external provider, reconciling it with internal database, categorizing it, and pushing it to end-users (browsers).\n\nAfter the talk, the audience should have a feeling on how to reason about a complex system relying on the concept of actors.\n\nThis will be a highly technical talk. Expect a lot of diagrams with an occasional code snippet in Elixir.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bac14141403187e96a1"
      },
      "github": "sasa1977",
      "short_bio": "All-round developer, Elixir/Erlang fanatic, aspiring technical writer, occasional speaker.",
      "name": "Saša Jurić",
      "twitter": "sasajuric",
      "long_bio": "A freelancer working on a revolutionary data anonymization system for Aircloak with previous experience in large web and desktop projects using various languages and technologies such as Elixir, Erlang, Ruby, JavaScript, C#, C++. The author of the pending Manning book \"Elixir in Action\", and an occasional blogger (http://theerlangelist.com). ",
      "image": "http://2014.webcampzg.org/images/speakers/sasa-juric.png",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53b1d3d0141414115c7c9b0e"
    },
    "short_abstract": "How to synchronize CSS animaciton with a sound effect, tips and tricks",
    "language": "English",
    "title": "Add sound effects to your CSS animations",
    "level": "Advanced",
    "submitted": {
      "sec": 1404167609,
      "usec": 0
    },
    "row_id": 53,
    "long_abstract": "CSS3 and HTML5 opened a rich playing field for adding multimedia content to your web, app and e-book projects, but rarely have these technologies been used together. One innovative way of combining them is adding sound effects to your CSS animations with the help of audio elements and a little bit of javascript. We'll go through the steps of analyzing the audio signal, obtaining the timing data and syncing the animation keyframes to that data. ",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53b1d3cf141414115c7c9b0c"
      },
      "github": "prkos",
      "short_bio": "Malcice sam u zurbi, kopirajte od prosle godine ako je hitno",
      "name": "Mihaela Jurković",
      "twitter": "prkos",
      "long_bio": "> Malcice sam u zurbi, kopirajte od prosle godine ako je hitno\n\n",
      "image": "http://example.com/notyet.jpg",
      "shirt": "Female L"
    }
  },
  {
    "_id": {
      "$id": "53b1d3d0141414115c7c9b0f"
    },
    "short_abstract": "Traps on your way to deliver on time, on budget and what is actually required. ",
    "language": "English",
    "title": "Traps and Pitfalls in Requirements management",
    "level": "Elementary",
    "submitted": {
      "sec": 1404167766,
      "usec": 0
    },
    "row_id": 54,
    "long_abstract": "According to some statistical data more than half of all project errors stem from badly managed requirements process. This staggering statistic shows the importance of understanding this process, how to communicate with clients and learning how to avoid making mistakes. In this presentation we'll identify points where most mistakes are made, analyze why they happen and give suggestions on how to overcome them. ",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53b1d3cf141414115c7c9b0c"
      },
      "github": "prkos",
      "short_bio": "Malcice sam u zurbi, kopirajte od prosle godine ako je hitno",
      "name": "Mihaela Jurković",
      "twitter": "prkos",
      "long_bio": "> Malcice sam u zurbi, kopirajte od prosle godine ako je hitno\n\n",
      "image": "http://example.com/notyet.jpg",
      "shirt": "Female L"
    }
  },
  {
    "_id": {
      "$id": "53b1d3d0141414115c7c9b0d"
    },
    "short_abstract": "Zen, Sussy, Bootstrap grid? What are the differences, pros and cons?",
    "language": "English",
    "title": "CSS Grids compared",
    "level": "Intermediate",
    "submitted": {
      "sec": 1404167438,
      "usec": 0
    },
    "row_id": 52,
    "long_abstract": "As CSS landscape changes with time so do CSS layout grids. With the advent of Sass grids markup became more clean but also, depending on your past experience and approach to CSS, sometimes harder to use. Find out about the best and latest approaches to grids, why you should use them, how to make sense of their underlining concepts and how to pick one to be your grid of choice.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53b1d3cf141414115c7c9b0c"
      },
      "github": "prkos",
      "short_bio": "Malcice sam u zurbi, kopirajte od prosle godine ako je hitno",
      "name": "Mihaela Jurković",
      "twitter": "prkos",
      "long_bio": "> Malcice sam u zurbi, kopirajte od prosle godine ako je hitno\n\n",
      "image": "http://example.com/notyet.jpg",
      "shirt": "Female L"
    }
  },
  {
    "_id": {
      "$id": "53dc99b86fc3850d17182e1b"
    },
    "status": "accepted",
    "short_abstract": "In a mobile-first world, can we finally start designing smart first and phones later?",
    "long_abstract": "Are responsive interfaces really just intelligent interfaces? Should our tools act smarter? Is it too much to ask for designers and developers to invest that extra mile? A few seconds each day X millions of users means hours saved.\n\nIntelligence and fewer features always wins over ignorance and more features.\nNow that we are designing with screen sizes and aspect ratios in mind, we should go a step further and plan strategically to utilize the device data that’s already collected and available.\n\nIn a mobile-first world, can we finally start designing smart first and phones later?",
    "language": "English",
    "title": "Taking Responsive a Step Further",
    "level": "Intermediate",
    "submitted": {
      "sec": 1406900635,
      "usec": 0
    },
    "row_id": 101,
    "speaker": {
      "_id": {
        "$id": "53dc99b66fc3850d17182e1a"
      },
      "github": "",
      "short_bio": "I am an interaction artist / designer / educator living in Croatia. Co-founder at @brlog, lecturer at @studijdizajna",
      "name": "Tin Kadoic",
      "twitter": "tinkadoic",
      "long_bio": "Tin is a M.Design and a lecturer at the School of Design in Zagreb. He lives and works with interactive media, balancing commercial, educational and personal work.\n\nWorking for more than 10 years with local studios and agencies for clients such as Coca-Cola, Adris, T-Com, Snickers, Ericsson, Carlsberg, Nutella. In 2009. co-founds a digital agency Brlog, part of Bruketa&Žinić OM group, where he is in charge of all aspects of digital communication. In his career he has been awarded with the Red Dot, ID, Adobe achievement award, IdejaX, MIXX, Effie, and has exhibited at the HDD Biennale (biennale Exhibition of Croatian Design), ZGRAF, and smaller exhibitions.\n\nFor the last four years he has also been working as a lecturer at the School of Design in Zagreb - Interactive media department, where he leads and organises workshops, guest lecturers and actively works on promoting interactive media inside the academic community.\n\nAs of 2014, he organises events and meet-ups as a local leader for IxDA Croatia, and helps as an IxDA Europe core team member.",
      "image": "https://d262ilb51hltx0.cloudfront.net/max/1896/1*cF6dH37dBwWJ1PdwXFyYOw.gif",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53b320ab141414136846868d"
    },
    "short_abstract": "Ovo predavanje, namijenjeno prvenstveno sistemašima, će se pozabaviti novostima u zadnjim verzijama Microsoftovog IIS-a – verzijama 8.0 i 8.5.",
    "language": "Croatian",
    "title": "IIS 8.x – što je novo?",
    "level": "Intermediate",
    "submitted": {
      "sec": 1404223792,
      "usec": 0
    },
    "row_id": 55,
    "long_abstract": "Ovo predavanje, namijenjeno prvenstveno sistemašima, će se pozabaviti novostima u zadnjim verzijama Microsoftovog IIS-a – verzijama 8.0 i 8.5. Biti će riječi o novim mogućnostima kao što su Aplication Request Routing, podršci za centralizirani SSL store, Dynamic Site Activation, te o poboljšanjima u području skalabilnosti, upravljivosti i sigurnosti. Kako ne bi sve ostalo samo na priči, pokazati ćemo i navedene mogućnosti kroz par vrlo kratkih demoa/scenarija.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53b320ab141414136846868c"
      },
      "github": "",
      "short_bio": "Technology enthusiast & bleeding-edge technology fan, trainer & presenter, more than a regular IT guy... always looking for new \"challenges\".",
      "name": "Tomica Kaniški",
      "twitter": "tkaniski",
      "long_bio": "Tomica je Microsoftov MVP sa višegodišnjim \"stažom\" - trenutno za područje Hyper-V, a radi kao Infrastructure Consultant u tvrtki CITUS. Može ga se pronaći kao predavača na raznim lokalnim i regionalnim konferencijama i događanjima. Uz to je i Microsoft Certified Trainer, nositelj „hrpe“ Microsoftovih certifikata te voditelj IT Pro user grupe u Varaždinu. Kao što je vidljivo, najviše je vezan uz Microsoftove proizvode i tehnologije, a posebno zainteresiran za ono što tek dolazi...",
      "image": "http://blog.kaniski.eu/wp-content/uploads/images/tk.jpg",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53d4d76a6fc385384df66196"
    },
    "status": "accepted",
    "short_abstract": "Flask is small framework, as long as you think small. It was designed as an extensible framework from the ground up. You as a developer have the power to pick and choose extensions, database packeges and much more. In contrast with larger frameworks Flask puts no restrictions, so most choices are made by you.",
    "long_abstract": "This talk will be review of some popular extensions, and their use in creating Flask application. Also routing, templates as well as number of configuration options will be emphasise as a way to structure large projects. Unlike most other most other web frameworks, Flask does not impose a specific organization. Near the end of presentation we will show how simple and easy is hosting Flask code on PythonAnywhere via GitHub. So let us all sit and listen the story of \"micro-framework\" called Flask.",
    "language": "English",
    "title": "The power of Flask",
    "level": "Intermediate",
    "submitted": {
      "sec": 1406239784,
      "usec": 0
    },
    "row_id": 72,
    "speaker": {
      "_id": {
        "$id": "53d4d76a6fc385384df66195"
      },
      "github": "",
      "short_bio": "Learnt Python at age roughly 17, making projects since then. Currently  interested in making apps go faster by drinking more coffee. Never liked cats, dogs are better, loyal animals.",
      "name": "Josip Katalinić",
      "twitter": "KatalinicJosip",
      "long_bio": "Developer, passionate gamer, cold beer lover, black ops mercenary, making awesome and fast web apps that run properly on most browsers that support HTML5 (yes IE I'm looking at you) and ofc.  freelancer. In one point got bored with developing android apps, web is the future, so here we are. Currently making accounting sotware and organizing small team of programmers and artists in making the best game ever.",
      "image": "http://photos2.meetupstatic.com/photos/member/2/6/0/e/highres_182649742.jpeg",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53d4d7666fc385384df6617f"
    },
    "status": "accepted",
    "short_abstract": "The traditional way of running a company has been documented by people from Harvard Business School and many other reputable institutions. If you do it differently you are considered to be in uncharted territory. I've started to notice that the new approaches companies like GitHub are taking to running a business are influenced a lot from the way families and family businesses are run.\n\nBecoming close with your coworkers and treating them like family helps foster innovation and creates an amazing culture where a variety of people can feel comfortable and enjoy themselves. Family members are honest with each other. Sometimes when someone critics you it can hurt, but when you know that it is backed with great respect and love you use it to help you become better.\n\nHaving a great idea, creating useful products, and writing stellar code can be done by smart people. The difficult part is figuring out how to get tons of smart people to work well together. The social aspect is hard, but when you build a culture based off of values that are important to a family you'll see the amazing things that can be done.",
    "long_abstract": "Many people know about how large corporations run, but they never hear about the companies that have been around for decades, but are mostly a lifestyle business. These are the companies that have truly learned to grow with their user and make sure they stay relevant for many years.",
    "language": "English",
    "title": "We Are Family",
    "level": "Elementary",
    "submitted": {
      "sec": 1405311333,
      "usec": 0
    },
    "row_id": 59,
    "speaker": {
      "_id": {
        "$id": "53d4d7656fc385384df6617e"
      },
      "github": "danishkhan",
      "short_bio": "I've been working at startups for a few years now. I've done programming for a few years and now I'm a sales engineer. On my free time I like to play soccer, snowboard and play board games.",
      "name": "Danish Khan",
      "twitter": "danishkhan",
      "long_bio": "Danish finds teaching to be enjoyable and helps out at some of the local user groups. He currently resides in the beautiful city of San Francisco. He works at GitHub a company that helps developers work better together than alone. We also sell stickers & t-shirts.",
      "image": "http://danishkhan.org/public/current_picture.jpg",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53d4d7666fc385384df66180"
    },
    "status": "accepted",
    "short_abstract": "Whether you like it or not you are doing sales all the time. Convincing your boss to use a new tool, applying for a job, and getting a freelance contract all require selling. If you work for a product company even if you are a developer when you talk about your product you are selling. When people think of sales they immediately think of the sleazy car salesman stereotype, but that is a very negative view of sales. Sales doesn't have to be done that way. The fact is everyone is doing sales all the time. Being aware of that fact and spending some time to learn a bit about how to do sales the right way will help you talk about your product and convince your boss to try something new you think will be good for the team.",
    "long_abstract": "Sales is an important skill that everyone needs to know about. It can help someone with their career or product. Even being aware of the fact that you are selling something can help a conversation you are a part of.",
    "language": "English",
    "title": "Everyone's in Sales",
    "level": "Elementary",
    "submitted": {
      "sec": 1405311460,
      "usec": 0
    },
    "row_id": 60,
    "speaker": {
      "_id": {
        "$id": "53d4d7656fc385384df6617e"
      },
      "github": "danishkhan",
      "short_bio": "I've been working at startups for a few years now. I've done programming for a few years and now I'm a sales engineer. On my free time I like to play soccer, snowboard and play board games.",
      "name": "Danish Khan",
      "twitter": "danishkhan",
      "long_bio": "Danish finds teaching to be enjoyable and helps out at some of the local user groups. He currently resides in the beautiful city of San Francisco. He works at GitHub a company that helps developers work better together than alone. We also sell stickers & t-shirts.",
      "image": "http://danishkhan.org/public/current_picture.jpg",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53d8d4966fc3853a3b4ff4db"
    },
    "status": "accepted",
    "short_abstract": "A tongue-in-cheek talk listing common mistakes in web development, reinventions of the wheel, etc. Will touch on frontend, backend, databases...",
    "long_abstract": "The talk serves as a \"what not to do\" for web development. It covers generic more-or-less-known exploited flaws, as well as those produced or exploited ;) by the author.\n\nTechnology-wise it will cover frontend, backend, databases, ...",
    "language": "English",
    "title": "Bad ideas and worst practices",
    "level": "Elementary",
    "submitted": {
      "sec": 1406652579,
      "usec": 0
    },
    "row_id": 83,
    "speaker": {
      "_id": {
        "$id": "53d8d4956fc3853a3b4ff4da"
      },
      "github": "allixsenos",
      "short_bio": "Doing web for a living for over 10 years, escaped from ASP to PHP, from PHP to Python. despises frontend, likes doing talks.",
      "name": "Luka Kladaric",
      "twitter": "allixsenos",
      "long_bio": "After 10 years of web development just about ready to go herd sheep on some hill somewhere. Currently CTO at hitlistapp.com, formerly developer at deviantart.com. Ran a small web studio in Croatia with a dozen happy customers. Dreams in matrixcode.",
      "image": "https://fbcdn-sphotos-d-a.akamaihd.net/hphotos-ak-xpf1/t1.0-9/10420410_10154281932860368_3858648230653567025_n.jpg",
      "shirt": "Male XXL"
    }
  },
  {
    "_id": {
      "$id": "53af0c081414141d48963a07"
    },
    "short_abstract": "Talk is about introducing unit testing to people who have never done unit testing before.",
    "language": "English",
    "title": "Unit testing 101",
    "level": "Elementary",
    "submitted": {
      "sec": 1401451208,
      "usec": 0
    },
    "row_id": 12,
    "long_abstract": "The talk will cower:\n * What is unit testing\n * Why use unit testing\n * How to use unit testing\n * What to test\n * And at least one demo (if time frame permits)\n",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bad14141403187e96a4"
      },
      "github": "",
      "short_bio": "I am a software developer that streams towards readable code. I am currently specializing in .NET development. ",
      "name": "Vladimir Kocjačič",
      "twitter": "LotusHints",
      "long_bio": "I am a software developer. Have been for over 15 years and have no intention to change it soon. I have developed applications in .NET (C# and VB), PHP, Perl, C++ and ANSI C.\nCurrently I am working as an in-house developer at Slovenian investment bank. Latest publicly visible project is online credit application for Slovenian SMBs.",
      "image": "https://onedrive.live.com/redir?resid=B9AF3049A8462FD7!647&authkey=!ADjr0SHEEhw5fWA&v=3&ithint=photo%2c.png",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53db39421414141e04df2ab2"
    },
    "status": "accepted",
    "short_abstract": "Microsoft is going open source - see how new \"Roslyn\" compiler and ASP.NET vNext enable you to develop ASP.NET applications on Linux!",
    "long_abstract": "Microsoft is continuing it's open source vision and as a part of that, new C# compiler and a part of ASP.NET is made open source. It's a big move for Microsoft, since it enables ASP.NET developers to work on platforms other then Windows. Talk will cover new technologies that make this possible (\"Roslyn\", ASP.NET vNext) and show how do this things work in practice.\nSince this is not yet finished product, talk will also cover tips&tricks to avoid frequent configuration issues and problems.",
    "language": "English",
    "title": "ASP.NET on Linux",
    "level": "Intermediate",
    "submitted": {
      "sec": 1406816803,
      "usec": 0
    },
    "row_id": 94,
    "speaker": {
      "_id": {
        "$id": "53db39421414141e04df2ab1"
      },
      "github": "",
      "short_bio": "CEO @ Axilis, Microsoft MVP for Azure",
      "name": "Bruno Kovačić",
      "twitter": "bkovacic",
      "long_bio": "Microsoft MVP for Windows Azure and founder of Axilis, company specialized in developing software solutions based on Microsoft platforms. Over the last seven years he was developing desktop, web and mobile applications, but lately he is mostly focused on the development of Windows Azure applications. Programming is his passion ever since elementary school when he stared participating in various IT competitions.",
      "image": "http://axilis.hr/bkovacic_400_400.png",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53af0c081414141d48963a04"
    },
    "short_abstract": "It's about how product managers and developers perceive their designer or design team - and why is it wrong.",
    "language": "English",
    "title": "Your designer is not your slut!",
    "level": "Intermediate",
    "submitted": {
      "sec": 1401390042,
      "usec": 0
    },
    "row_id": 9,
    "long_abstract": "Purpose of this talk is for business owners, project leaders and developers (and all alike) to see the other side of design, beyond what is shown in the presentation slides once the design process is at its end.\n\nAnd also, to see what happens (or will happen) to the creative mind they employ once they force them to add a golden crown on top of the milking cow in the election posters. (Yes! That happend!)\n\nTalk is based on 10 year experience in graphic, web and start-up industry, of which better part was being Don Quixote in defense of best practices, and why it was time to stop.\n\nDevelopers need to trust in designers - not be clients from hell.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bac14141403187e96a2"
      },
      "github": "universeceo",
      "short_bio": "UI/UX designer, front end developer, entrepreneur, Stand Up Comedian, ...and some more big words also.",
      "name": "Tomislav Kozačinski",
      "twitter": "UniverseCEO",
      "long_bio": "My name is Tomislav Kozačinski.\nI am UI / UX designer and front end developer from Velika Gorica.\n\nI just finished my contract with Hitlist, New York based start-up centered around flight search. www.hitlistapp.com\nWhere, among other things, I worked on redesigning the app into new iOS 7 version.\n\nBeside that, I work for TopTal network as a freelancer, on mobile app design and front end development.\n\nMy current focus is further work on mobile apps, and getting my own start-up off the ground.\n\nIn my spare time I perform as a Stand Up comedian across the Balkans.",
      "image": "http://tomislav.kozacinski.com/kozacinskiprofilna.png",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53af0c081414141d48963a05"
    },
    "short_abstract": "If you are working on product development - you need to live it 24/7, not just work on it 9-5 if you wish to get most out of your talent.",
    "language": "English",
    "title": "Living the product",
    "level": "Intermediate",
    "submitted": {
      "sec": 1401391602,
      "usec": 0
    },
    "row_id": 10,
    "long_abstract": "Product development as a process needs your attention all day, every day. \n\nIt's not hours you spend in front of Photoshop drawing the pixels, it's days you spend thinking how it would feel using it.\nNights you spend awake thinking of the patterns used to achieve desired output.\n\nThis talk describes process of integrating train of thought into usable in app user experience... ",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bac14141403187e96a2"
      },
      "github": "universeceo",
      "short_bio": "UI/UX designer, front end developer, entrepreneur, Stand Up Comedian, ...and some more big words also.",
      "name": "Tomislav Kozačinski",
      "twitter": "UniverseCEO",
      "long_bio": "My name is Tomislav Kozačinski.\nI am UI / UX designer and front end developer from Velika Gorica.\n\nI just finished my contract with Hitlist, New York based start-up centered around flight search. www.hitlistapp.com\nWhere, among other things, I worked on redesigning the app into new iOS 7 version.\n\nBeside that, I work for TopTal network as a freelancer, on mobile app design and front end development.\n\nMy current focus is further work on mobile apps, and getting my own start-up off the ground.\n\nIn my spare time I perform as a Stand Up comedian across the Balkans.",
      "image": "http://tomislav.kozacinski.com/kozacinskiprofilna.png",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53b1d3cf141414115c7c9b09"
    },
    "short_abstract": "Debugging CSS can be really hard when you face the fact that there is a lot of browsers, devices and screen resolutions available. If you are developing a web app it can be very time consuming to tweak CSS, click through the app and check if it looks right on all of the browsers. This talk will present personal experiences while building a tool for CSS debugging across multiple browsers.",
    "language": "English",
    "title": "Conquering CSS debugging",
    "level": "Intermediate",
    "submitted": {
      "sec": 1404155582,
      "usec": 0
    },
    "row_id": 50,
    "long_abstract": "Because of my personal experience and needs I've built a tool that can modify pages CSS across multiple browsers simultaneously. In addition, I've decided to expand its functionality to provide feedback from the browser and show what property is really being used.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53b1d3cf141414115c7c9b08"
      },
      "github": "DarkoKukovec",
      "short_bio": "JavaScript developer at Infinum. JavaScript all the things!",
      "name": "Darko Kukovec",
      "twitter": "DarkoKukovec",
      "long_bio": "JavaScript Gladiator at Infinum. Firm believer in Atwood's Law.",
      "image": "http://kukovec.eu/slika_profila.png",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53d775606fc3851defc3886b"
    },
    "status": "accepted",
    "short_abstract": "After quitting the 9-5 as a nuclear engineer, she was out of money and out of ideas. Robyn will discuss the 9 week transition and how she landed her first big contract with 140 characters, the similarities/differences in both careers, what she learned along the way and where she is going now.",
    "long_abstract": "Robyn Larsen became a developer out of pure desperation. After quitting the 9-5 as a nuclear engineer, she was out of money and out of ideas. Fast forward: Robyn is now working with some of the world’s top agencies including MetaLabs and Cossette. In this session, Robyn will discuss the 9 week transition and how she landed her first big contract with 140 characters, the similarities/differences in both careers, what she learned along the way and where she is going now.",
    "language": "English",
    "title": "9 weeks from Nuclear Engineer to Front End Developer",
    "level": "Intermediate",
    "submitted": {
      "sec": 1406568523,
      "usec": 0
    },
    "row_id": 79,
    "speaker": {
      "_id": {
        "$id": "53d7755f6fc3851defc3886a"
      },
      "github": "https://github.com/robynlarsen",
      "short_bio": "Former nuclear engineer now blurring the lines between work and play as a front end developer. Using code as the medium to help bring beautiful and intuitive designs to life. Entrepreneur with a love for snowboarding, yoga & travel.",
      "name": "Robyn Larsen",
      "twitter": "robyn_larsen",
      "long_bio": "Robyn Larsen is a former nuclear engineer now blurring the lines between work and play as a front end web developer, mentor and entrepreneur. Her tools of choice are HTML5, CSS3, Sass, responsive design, and Javascript. She lives by challenging assumptions, improving process, and never settles. Born & raised in small town Alberta - over the past few years she has snowboarded some of the world’s most majestic mountains, travelled to over 23 countries, cultivated movements and mentored students. Now you can now find her based in Toronto working with brands from all over the world.\n\nRobyn holds a Bachelor’s Degree in Engineering from the University of Alberta and is an alumni of HackerYou in Toronto.\n\nToday, Robyn is now blurring the lines between work and play. Focusing on perfecting her vanilla Javascript and using code as the medium to help bring beautiful and intuitive designs to life.   ",
      "image": "http://www.robynlarsen.ca/images/RobynLarsen_400square.png",
      "shirt": "Female XS"
    }
  },
  {
    "_id": {
      "$id": "53d4d76b6fc385384df6619c"
    },
    "status": "accepted",
    "short_abstract": "python object model & functions, scoping & closures, meta-programming, module loading, descriptors, context-managers, __methods__ ...\n",
    "long_abstract": "Python has an object model which suites all common use cases and lot of special ones.\n\nPython hits a sweet spot when combining object and functional paradigm. \n\nIn this talk more advanced and/or less commonly used Python concepts, modules, classes, functions and techniques will be presented, mainly by demonstrating the concepts by examples (runnable Python code).\n\nTalk overview: \n\n- basic building blocks, everything is an object (state), functions everywhere (change state)\n- object types, immutable objects, mutable objects\n- scoping global local and closures\n- classes - mutable, everything is inheritable\n- multiple inheritance & mixins, MRO - method resolution order \n- dynamic class creation, class decorator, metaclasses \n- @property and \"relation\" to descriptors \n- context managers\n- useful reserved object.__methods__ \n- interesting modules and standard classes\n- module loading & startup objects creation\n",
    "language": "English",
    "title": "Python object model and meta-friends (source code included)",
    "level": "Intermediate",
    "submitted": {
      "sec": 1406390140,
      "usec": 0
    },
    "row_id": 76,
    "speaker": {
      "_id": {
        "$id": "53d4d76a6fc385384df6619a"
      },
      "github": "",
      "short_bio": "Freelancer, Sr. Software Engineer",
      "name": "Robert Lujo",
      "twitter": "trebor74hr",
      "long_bio": "Mr.Sc., developing software since C64, 17 years of professional experience, from small to enterprise applications, Končar, Sunce osiguranje, Combis, Eu-informatika, Adacta (as a freelancer), freelancer. \n\nTechnologies: whatever client needs, web, desktop, java, c# ... tools of choice for last 8 years: web, python, django. \n\nSystem architect, lead developer, project manager...",
      "image": "https://pbs.twimg.com/profile_images/1209702114/portrait-IMG_4202_400x400.png",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53d4d76b6fc385384df6619b"
    },
    "status": "accepted",
    "short_abstract": "ElasticSearch - index server, json documents, feature-rich, scalable. How ES can be used instead of/with relational DB? 2 use-cases",
    "long_abstract": "Although ElasticSearch (ES) primary purpose is to be used as index/search server, in its featureset ES overlaps with common NoSql database; better to say, document database.\n\nWhy this could be interesting and how this could be used effectively?\n\nTalk overview: \n\n - ES - history, background, philosophy, featureset overview, focus on indexing/search features\n - short presentation on how to get started - installation, indexing and search/retrieving\n - Database should provide following functions: store, search, retrieve -> differences between relational, document and search databases\n - it is not unusual to use ES additionally as an document database (store and retrieve)\n - an use-case will be presented where ES can be used as a single database in the system (benefits and drawbacks)\n - what if a relational database is introduced in previosly demonstrated system (benefits and drawbacks)\n - ES is a nice and in reality ready-to-use example that can change perspective of development of some type of software systems\n",
    "language": "English",
    "title": "ElasticSearch - index server used as a document database (with examples)",
    "level": "Intermediate",
    "submitted": {
      "sec": 1406388261,
      "usec": 0
    },
    "row_id": 75,
    "speaker": {
      "_id": {
        "$id": "53d4d76a6fc385384df6619a"
      },
      "github": "",
      "short_bio": "Freelancer, Sr. Software Engineer",
      "name": "Robert Lujo",
      "twitter": "trebor74hr",
      "long_bio": "Mr.Sc., developing software since C64, 17 years of professional experience, from small to enterprise applications, Končar, Sunce osiguranje, Combis, Eu-informatika, Adacta (as a freelancer), freelancer. \n\nTechnologies: whatever client needs, web, desktop, java, c# ... tools of choice for last 8 years: web, python, django. \n\nSystem architect, lead developer, project manager...",
      "image": "https://pbs.twimg.com/profile_images/1209702114/portrait-IMG_4202_400x400.png",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53af0c0d1414141d48963a19"
    },
    "short_abstract": "Use the power of ESI and HTTP Cache for performant page delivery with Symfony2 and eZPublish5 CMS",
    "language": "English",
    "title": "The power of ESI and HTTP Cache for performant page delivery",
    "level": "Intermediate",
    "submitted": {
      "sec": 1403144941,
      "usec": 0
    },
    "row_id": 30,
    "long_abstract": "For web sites with frequent content changes, like news portals, an optimal cache strategy is crucial for serving millions of page views. To just cache every page statically is usually not an option as editors want to see the changes immediately. With the new version of eZ Publish CMS, which  is based on Symfony PHP framework, content caching is based on HTTP Cache. This enables much tighter integration with reverse proxies like Varnish and better control of cached pages. Also, Symfony provides ESI capabilities for controlling reverse proxy cache even on block level so invalidating a whole page is not expensive. ",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bb114141403187e96b2"
      },
      "github": "",
      "short_bio": "International Business Development at Netgen, eZ Publish specialist, eZ Publish Innovation Board member, eZSummerCamp and PHPSummerCamp organizer",
      "name": "Ivo Lukač",
      "twitter": "ilukac",
      "long_bio": "Co-founded Netgen, web development agency, back in 2002. At the beginning worked as developer on various desktop and web applications. From 2005 focusing on eZ Publish CMS as a base framework for web projects. By 2011 recognized eZ Community member and contributor, awarded as the eZ Blogger of the Year. Invited to the eZ Innovation Board in 2012. in the same year organised the eZ Publish Summer Camp int Croatia, the biggest unofficial community gathering ever. Recently involved more and more in Netgen's international business development ",
      "image": "https://pbs.twimg.com/profile_images/1317086497/ilukac.jpg",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53af0c0a1414141d48963a0f"
    },
    "short_abstract": "In last few years the web development process has changed dramatically so now with \"mobile first approach\", \"progressive enhancement\" approach gaining more importance than \"degradation gracefully\" approach has a few years before.",
    "language": "English",
    "title": "Enhancement vs degradation",
    "level": "Intermediate",
    "submitted": {
      "sec": 1402063845,
      "usec": 0
    },
    "row_id": 20,
    "long_abstract": "When progressive enhancement–offering a basic version of a feature that all clients can use as a default–was introduced as a concept, JavaScript applications seemed as relevant as flying cars. As JS became more powerful, it seemed we'd reach a point where we could forget about PE entirely. For the things we originally used it for, we now have rock-solid libraries and polyfills to provide abstractions that make PE easy. But as JS has advanced, we've started writing things that can't be polyfilled. We know now how to progressively enhance widgets and user interactions. We'll talk about how we progressively enhance entire applications, and why it's potentially more important than ever that we do so.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0baf14141403187e96aa"
      },
      "github": "tomislavmesic",
      "short_bio": "Oduvijek se bavim razvojem weba, a od 2013 radim za Pet Minuta na pozicijji front-end arhitekta.",
      "name": "Tomislav Mesić",
      "twitter": "tomislavmesic",
      "long_bio": "Od početka 2013 sam u Pet Minuta i tamo radim na poziciji front-end arhitekta, a prije toga … oduvijek se bavi razvojem weba pa sam tako radio i 8 godina za Perpetuum na poziciji konzultanta i votidelja tima za razvoj web rješenja. Inženjerske titule stekao sam na FOI-u i VŠPR-u. Višegodišnji sam predavač na raznim tehničkim konferencijama i skupovima, a profesionalno sam se orijentirao na klijentsku stranu izgradnje weba što uključuje sve po pitanju projektiranja, front-end-a, usabilitya, UX-a i web standarda.",
      "image": "https://pbs.twimg.com/profile_images/378800000854291612/cb6c34c80309309009d2a0bde8b25b81.jpeg",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53af0c0f1414141d48963a21"
    },
    "short_abstract": "Any non-trivial site or application on the Web today will contain a large amount of HTML, CSS, and JavaScript. As the use of the Internet evolves and our dependence on it increases, having a plan for organizing and maintaining your front-end code is an absolute must.",
    "language": "English",
    "title": "Decoupling Your HTML, CSS, and JavaScript",
    "level": "Advanced",
    "submitted": {
      "sec": 1403897690,
      "usec": 0
    },
    "row_id": 38,
    "long_abstract": "In today's large Web companies, an increasing number of people are touching an increasingly large percentage of the front-end code. As a result, most organizations struggle to keep their code modular. Changes to one part of the application often inadvertently break unrelated parts downstream.\n\nPreventing unintended consequences is not an easy problem to solve, especially since HTML, CSS, and JavaScript are, by their nature, co-dependent.\n\nTo make matters worse, traditional computer science principles like the separation of concerns, which have long been a part of server-side development, rarely get discussed when it comes to front-end code.\n\nThere will always be some coupling between HTML, CSS, and JavaScript. For better or for worse, these technologies were built to interact with each other. As an example, a fly-in transition might be defined with a class selector in a stylesheet, but it is often triggered by user interaction, applied via JavaScript, and initiated by adding the class to the HTML.\n\nSince some coupling in our front-end code is inevitable. Our goal shouldn't be to simply eliminate coupling altogether. It should be to minimize the coupling that makes certain code parts unnecessarily dependent on others.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bb314141403187e96b9"
      },
      "github": "tomislavmesic",
      "short_bio": "Everything I've worked in my profesional life is web ... web design, web, development, web architecture etc. Since 2013 I'm in Five Minutes ltd. as front-end architect.",
      "name": "Tomislav Mesić",
      "twitter": "tomislavmesic",
      "long_bio": "Since the beginning of 2013 I'm in Five Minutes ltd. on front-end architect position. Before that ... I've always been closely coupled with web development so I've worked eight years for Perpetuum Mobile on web design team leader and web solutions consultant positions. Education engineer degrees I've earned on FOI in Varazdin and University College for Applied Computer Engineering in Zagreb. I've been speaking at various technical conferences and meetings, and professionally I was always been focused on the client side of the web which includes everything in terms of design, front-end, usability, UX and web standards.",
      "image": "http://2013.webcampzg.org/wp-content/uploads/2013/09/tomislav_mesic-200x200.jpg",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53af0c0e1414141d48963a20"
    },
    "short_abstract": "Techniques for performance monitoring and optimization on live ASP.NET web applictions.",
    "language": "English",
    "title": "ASP.NET application performance monitoring and optimization",
    "level": "Intermediate",
    "submitted": {
      "sec": 1403860954,
      "usec": 0
    },
    "row_id": 37,
    "long_abstract": "Application development is an iterative process during which the application is constantly evolving and improving its functionality and performance. Quite often after deployment in production the process of performance monitoring is left out or considered irrelevant. Instead we rely on ad-hoc estimates and user complaints about what parts of the application should be optimized. This presentation focuses on techniques how to monitor, analyze, and optimize performance of a production application.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bb314141403187e96b8"
      },
      "github": "",
      "short_bio": "Very curious in nature, I always seek more knowledge and try to apply it in practice. Don't like to waste time, so performance really matters.",
      "name": "Jure Mijić",
      "twitter": "jumijic",
      "long_bio": "Very curious in nature, I always seek more knowledge and try to apply it in practice. Learning the basics at FER (Zagreb) was not enough. I spent a lot of free time learning about the deepest secrets about programming, specifically C# and .NET technology. I spent three years working at FER on projects involving text mining and natural language processing. Later I switched my carrier path and started working in the IT development industry. At the moment I’m working as CTO at Lemax.",
      "image": "http://dl.dropboxusercontent.com/u/3159360/slike/jure-mijic-big.JPG",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53af0c0b1414141d48963a12"
    },
    "short_abstract": "A talk about one possible solution to the JavaScript problem. I'll talk about the way I develop for web — React/OM provides expressive frontend; Elixir provides scalable backend. ",
    "language": "English",
    "title": "Modern Approaches to the Javascript Problem",
    "level": "Intermediate",
    "submitted": {
      "sec": 1402213361,
      "usec": 0
    },
    "row_id": 23,
    "long_abstract": "It's well known that JavaScript wasn't designed to be anything more than a weapon in the Browser Wars, adding a layer of interactivity to the pages of the ancient Web by means of writing very short scripts.\n\nWhen such a language grows big and starts to be used to implement complex systems we face a lot of problems. To name a few — defensive programming, non-existent type system, fragile application architecture. It also yields a bigger problem of programmers not being able to write expressive and safe code.\n\nIn this talk we examine the modern approaches to fixing JavaScript. Our goal is to find a solution that allows us to write expressively and to get strong guarantees for applications we build.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0baf14141403187e96ac"
      },
      "github": "manpages",
      "short_bio": "Latvian. Zera yisrael, programmer, cryptoconformist, caldari. Erlang professional. I enjoy discrete math and progressive rock. 0xFD6ADF70.",
      "name": "Jonn Mostovoy",
      "twitter": "podmostom",
      "long_bio": "Born in Rīga, Latvia. Installed my first UNIX-like system when I was 14. Worked as a web developer since I was 16. Worked in banking. Eventually got tired of \"mainstream\" \"boring\" technology stacks as those are too verbose and clumsy and switched to Erlang. Worked as a senior Erlang developer, then worked in a Canadian startup. Kinda known for implementing pretty printing for Elixir standard library. Now freelancing and available for hire.",
      "image": "http://2014.webcampzg.org/images/speakers/jonn-mostovoy.png",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53af0c0a1414141d48963a0c"
    },
    "short_abstract": "Importance of monitoring key aspects of your web application and organizing gathered data so you can instinctively react and fix problems.",
    "language": "English",
    "title": "Dashboards for devops and other web folks",
    "level": "Elementary",
    "submitted": {
      "sec": 1401926723,
      "usec": 0
    },
    "row_id": 17,
    "long_abstract": "It would be nice if devops could sit down with web applications and discuss their feelings over cup of coffee. Instead, they have to jump through hoops and figure out what is going on by using tools such as StatsD/Graphite, Nagios, Cacti, New relic and many others. Successful data collection is only half of the solution. Presenting real time data in a way that it intuitively shows you that something is different and aiding you in pinpointing problem makes up other half. \nTalk will focus on importance of monitoring web applications and give advice on how to organize your dashboard for quick reactions. Find out tips and tricks as well as what impact had running a dashboard monitor on overall project performance.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bae14141403187e96a8"
      },
      "github": "",
      "short_bio": "Passion driven developer, involved in running local PHP usergroup and mentoring new developers. Fails like a pro at being a stand-up comedian.",
      "name": "Luka Mužinić",
      "twitter": "lmuzinic",
      "long_bio": "Passionate about being a developer, teacher and mentor for newcomers into world of programming. Involved in organizing ZgPHP user group meetings, workshops and conferences. \nCurrently working as senior software engineer for HomeExchange. Enjoys playing and watching odd and unpopular sports, at least in Croatia.",
      "image": "http://2014.webcampzg.org/images/speakers/luka-muzinic.png",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53d8d4a16fc3853a3b4ff4e5"
    },
    "status": "accepted",
    "short_abstract": "User testing, that is verifying your assumptions with real, potential customers, is very important at the earliest stages of your product. Not everybody has a team or a budget for doing focus group tests, UX test labs and eye-tracking equipment.",
    "long_abstract": "We will cover Guerilla testing, Flow recording, 5 second tests, flow tests, A/B tests, coffee tests and lean user testing, Lookback for iOS and more to give you valuable insights about your users.",
    "language": "English",
    "title": "User testing without going bankrupt",
    "level": "Elementary",
    "submitted": {
      "sec": 1406716248,
      "usec": 0
    },
    "row_id": 90,
    "speaker": {
      "_id": {
        "$id": "53d8d4a06fc3853a3b4ff4e4"
      },
      "github": "avgp",
      "short_bio": "Software engineer, mentor and open source contributor. Generic geek and jack of all trades in IT.",
      "name": "Martin Naumann",
      "twitter": "g33konaut",
      "long_bio": "Martin is open source contributor and web evangelist by heart from Zurich with nearly a decade experience from the trenches of software engineering in multiple fields.\n\nHe spends his day thinking about moving the web forward, fixing problems and breaking things for fun&profit.",
      "image": "https://drive.google.com/file/d/0B9MEoZDi5-peYy1uM0h0NUdQZFk/edit?usp=sharing",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53d8d4a26fc3853a3b4ff4e6"
    },
    "status": "accepted",
    "short_abstract": "Web components are an interesting set of standard proposals, promising to make web development more modular and speed up development. \nIn this talk, we will take a look at what web components are and how they work - including a live coding demonstration.",
    "long_abstract": "The web evolved from a fancy document viewer to a powerful and rich application platform... but the web stack of HTML, CSS and Javascript has fallen a bit behind.\nOften times when new UI patterns or components were needed, these had to be built as a blob of Javascript, CSS and HTML that could easily collide with the application's own markup and functionality, let alone missing semantics of divs that turned out as date pickers and such.\nLuckily the W3C saw these issues, too and came up with the web component standards.\nBut what are web components? \nHow do they change the way we will be building web applications in the near future? \nCan they already be used?\nWe will answer these and more questions in this walkthrough with live demos.",
    "language": "English",
    "title": "Web components 101",
    "level": "Intermediate",
    "submitted": {
      "sec": 1406724872,
      "usec": 0
    },
    "row_id": 91,
    "speaker": {
      "_id": {
        "$id": "53d8d4a06fc3853a3b4ff4e4"
      },
      "github": "avgp",
      "short_bio": "Software engineer, mentor and open source contributor. Generic geek and jack of all trades in IT.",
      "name": "Martin Naumann",
      "twitter": "g33konaut",
      "long_bio": "Martin is open source contributor and web evangelist by heart from Zurich with nearly a decade experience from the trenches of software engineering in multiple fields.\n\nHe spends his day thinking about moving the web forward, fixing problems and breaking things for fun&profit.",
      "image": "https://drive.google.com/file/d/0B9MEoZDi5-peYy1uM0h0NUdQZFk/edit?usp=sharing",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53db39421414141e04df2ab0"
    },
    "status": "accepted",
    "short_abstract": "This presentation is about how developers can enable themselves to be innovative and the step by step process to achieve it.",
    "long_abstract": "The practice of Innovation is a core strategy now-a-days for most of the companies, to stay ahead of business and to survive the competition. Learning a technology is one thing, but setting your mindset to innovate, to create, to inspire, to empower is an another thing. This presentation will talk about how developers can develop their mindset to be innovative, to be deep thinking about the problems, creating challenging solutions, building smart tools and services and more importantly explaining the step by step process on how to achieve success in the process of innovation. Starting from establishing an innovation culture, knowing what innovation and the importance of it, being realistic, making mistakes and evaluating.",
    "language": "English",
    "title": "Enable yourself to be Innovative",
    "level": "Advanced",
    "submitted": {
      "sec": 1406805194,
      "usec": 0
    },
    "row_id": 93,
    "speaker": {
      "_id": {
        "$id": "53db39421414141e04df2aaf"
      },
      "github": "",
      "short_bio": "I am Magith, who believes that, the combining forces of technology and innovation will make this world a better place and that is what I evangelise about!",
      "name": "Magith Noohukhan",
      "twitter": "magithn",
      "long_bio": "Born in India, living in Germany, holding Masters degree in Engineering with more than 10 years of experience working in different countries, with the passion for technology. Currently working for a leading business networking company XING in Hamburg, Germany, serving more than 14 million users worldwide with the mission for a better working life for everyone. As the technology Evangelist I passion performing in front of broad community of developers driving excitement around developer related technologies and innovation. I drive the innovation at XING and I Evangelise developers enabling them in being innovative, coming up with creative ideas and to build a better web.",
      "image": "https://www.xing.com/profile/Magith_Noohukhan",
      "shirt": "Male S"
    }
  },
  {
    "_id": {
      "$id": "53b1d3cd141414115c7c9afb"
    },
    "short_abstract": "It is about working on open source project and how open source project helps you built your business.",
    "language": "English",
    "title": "Why open source helps build your business?",
    "level": "Elementary",
    "submitted": {
      "sec": 1404122296,
      "usec": 0
    },
    "row_id": 42,
    "long_abstract": "Are you one of those people who labels working on open source project \"a waste of time\"? Quite the contrary, working on an open source project is fantastic way to promote yourself or company. We will show you how open source changed our company, opened our business to international market and introduced us to new clients.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53b1d3cc141414115c7c9af9"
      },
      "github": "antonioperic",
      "short_bio": "Developer, entrepreneur, conference organizer, PhD student in Computer Science, not yet husband and father",
      "name": "Antonio Perić-Mažar",
      "twitter": "antonioperic",
      "long_bio": "Last 8 years I am developing custom web applications for clients and last 4 and half years I am working with Symfony2 framework. I have built a lot of various projects on Symfony2: ecommerce, social apps, custom CMS solutions and a lot more. Also I have experience in providing Symfony trainings and consulting for our clients. Work for some large clients as Replay, OshKosh, Carters, Arena Italia and more.",
      "image": "https://www.dropbox.com/s/jgf3906rmohpnqb/antonio_peric_mazar.png",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53b1d3cc141414115c7c9afa"
    },
    "short_abstract": "About tips and tricks for attending conferences.",
    "language": "English",
    "title": "Why the f*ck do we need conferences for?",
    "level": "Elementary",
    "submitted": {
      "sec": 1404122290,
      "usec": 0
    },
    "row_id": 41,
    "long_abstract": "You think that conferences are just for yuppies, hipsters or serious businesses? You think that whole point of a conference is to send your employees for a paid leave? You think that people are just wasting their time? Well you are f*cking wrong! If you are tired of working underpaid local jobs, see how we used our presence on conferences to grow our business.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53b1d3cc141414115c7c9af9"
      },
      "github": "antonioperic",
      "short_bio": "Developer, entrepreneur, conference organizer, PhD student in Computer Science, not yet husband and father",
      "name": "Antonio Perić-Mažar",
      "twitter": "antonioperic",
      "long_bio": "Last 8 years I am developing custom web applications for clients and last 4 and half years I am working with Symfony2 framework. I have built a lot of various projects on Symfony2: ecommerce, social apps, custom CMS solutions and a lot more. Also I have experience in providing Symfony trainings and consulting for our clients. Work for some large clients as Replay, OshKosh, Carters, Arena Italia and more.",
      "image": "https://www.dropbox.com/s/jgf3906rmohpnqb/antonio_peric_mazar.png",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53d4d7686fc385384df6618d"
    },
    "status": "accepted",
    "short_abstract": "In this talk we will make a review of existing solutions which provide \nan entire backend as a service, and show how to use them \nfor syncing data and creating real time web applications.",
    "long_abstract": "Much of the backend code we write for most small and many mid-sized applications is boilerplate. \nAs a matter of fact, it is so boilerplate that very often it can be abstracted and consumed as a service.\nThis type of architecture allows developers to work mostly, if not entirely, on the front end,\nfocusing on delivering more features, and a much better user experience.\nOn the other hand, a NoBackend service can take care of creating user accounts, sending emails, storing data, issuing payments and any other\nfunctionality that you have implemented several times before.\nTo take things even further, we can easily leverage this type of architecture to synchronize data between clients in real time.\n\nIn this talk we will present existing solutions, both commercial and open source, \nwhich provide a \"backend as a service\", and show how you can use them \nfor either rapid prototyping, or developing a full blown, real time application.",
    "language": "English",
    "title": "Abstracting the backend. NoBackend solutions and syncing data in real time.",
    "level": "Intermediate",
    "submitted": {
      "sec": 1405605880,
      "usec": 0
    },
    "row_id": 67,
    "speaker": {
      "_id": {
        "$id": "53d4d7686fc385384df6618c"
      },
      "github": "",
      "short_bio": "I am web developer with a passion for the JavaScript ecosystem. \nWorking as a freelancer, I get to use new technologies on regular basis,\nwhich motivates me to share my experiences with other people in the industry.\n",
      "name": "Filip Petkovski",
      "twitter": "",
      "long_bio": "I am a web developer working at IN2 Ltd, Croatia. In the past I have worked on an open source platform for machine translation through the Google Summer of Code project.\n\nMy interest are JavaScript, WebComponents and AngularJS.",
      "image": "http://www.deviantpics.com/DST",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53d4d7686fc385384df6618b"
    },
    "status": "accepted",
    "short_abstract": "How Etsy tracks millions of packages -- from vendors all over the world using over 100 different shipping providers -- in an efficient and scalable manner.",
    "long_abstract": "At Etsy, we track millions of packages daily that get shipped through several shipping carriers worldwide like USPS, FedEx, DHL and several others. Daily updates, from whether a shipping label has been created to whether a package is out for delivery -- are in the order of millions.\n\nOur goal with providing shipping tracking information to our members -- both sellers and buyers -- is to provide accurate, timely tracking data that answers the question “where is my package right now?”\n\nTracking packages is an example of a general class of problems that require getting frequent updates for large amounts of data. More importantly, as the Etsy marketplace grows, this data set becomes increasingly larger, posing the challenge of being able to flawlessly manage long term and sustained growth.\n\nUsing a combination of data sharding, sql, asynchronous processing, faux-queueing and batch processing, we’ve created an efficient, scalable, and resilient system built on existing infrastructure that needs minimal maintenance.\n\nIn this talk we will walk you through the problem definition, the architecture we built, and the metrics we use for monitoring the system.",
    "language": "English",
    "title": "Building a scalable system for tracking Shipping Packages",
    "level": "Intermediate",
    "submitted": {
      "sec": 1405527728,
      "usec": 0
    },
    "row_id": 66,
    "speaker": {
      "_id": {
        "$id": "53d4d7686fc385384df6618a"
      },
      "github": "",
      "short_bio": "Premshree Pillai is an engineer at Etsy working on various infrastructure pieces, currently on the Shipping team. In the past he has worked on several experimental products at Yahoo.",
      "name": "Premshree Pillai",
      "twitter": "premshree",
      "long_bio": "Premshree Pillai is an engineer and has worked with Etsy for four years, working on various infrastructure projects. In the past he helped build several products at Yahoo!, including Live, 360, and International Blogs.\n\nOutside of work, Premshree loves to cook, take photos, travel, and understand history.",
      "image": "https://www.dropbox.com/s/ov0v57tw3iiqu2l/me-dumbo-park-png.png",
      "shirt": "Male S"
    }
  },
  {
    "_id": {
      "$id": "53af0c0b1414141d48963a10"
    },
    "short_abstract": "The talk would discuss the MEAN Stack and why it's the next great platform to develop great applications with.",
    "language": "English",
    "title": "Getting MEAN",
    "level": "Intermediate",
    "submitted": {
      "sec": 1402084178,
      "usec": 0
    },
    "row_id": 21,
    "long_abstract": "I'd be discussing how the stack can work as a whole, talk about some architectural decisions that one should take into consideration and if possible do some live coding as well?",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0baf14141403187e96ab"
      },
      "github": "tamaspiros",
      "short_bio": "Web advocate, author, teacher & preacher of super-heroic web technologies.",
      "name": "Tamas Piros",
      "twitter": "tpiros",
      "long_bio": "Web Advocate - currently working as a technical trainer at a NoSQL organisation. I'm interested in everything JavaScript (back and frontend) as well as Web Components.",
      "image": "http://me.tamas.io/css/tamas.png",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53af0c0b1414141d48963a11"
    },
    "short_abstract": "Why I believe Web Components are the next big thing",
    "language": "English",
    "title": "Web Components FTW",
    "level": "Intermediate",
    "submitted": {
      "sec": 1402084383,
      "usec": 0
    },
    "row_id": 22,
    "long_abstract": "Web Components are the latest buzz around the web. It allows developers to define widgets, encapsulate functionality and allow easy-reuse.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0baf14141403187e96ab"
      },
      "github": "tamaspiros",
      "short_bio": "Web advocate, author, teacher & preacher of super-heroic web technologies.",
      "name": "Tamas Piros",
      "twitter": "tpiros",
      "long_bio": "Web Advocate - currently working as a technical trainer at a NoSQL organisation. I'm interested in everything JavaScript (back and frontend) as well as Web Components.",
      "image": "http://me.tamas.io/css/tamas.png",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53b1d3cd141414115c7c9afe"
    },
    "short_abstract": "Move fast & break programming languages.",
    "language": "English",
    "title": "HHVM and Hack: Might These Be The Droids We Are Looking For?",
    "level": "Elementary",
    "submitted": {
      "sec": 1404131333,
      "usec": 0
    },
    "row_id": 44,
    "long_abstract": "HHVM is a new implementation of PHP backed by a powerful interpreter and a JIT compiler. Hack is a new programming language targeting HHVM which augments PHP with a type system, proper closures, async capabilities, and many more.\n\nThe talk will give a high-level overview of the features of both, outline the benefits of the alternative execution model brought by HHVM, and possible day-to-day benefits introduced by Hack.\n\nThis talk will be a more succinct version of a similar talk the author gave at ZgPHP Meetup #34.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bab14141403187e969e"
      },
      "github": "nikolaplejic",
      "short_bio": "I like programming computers.",
      "name": "Nikola Plejić",
      "twitter": "nikolaplejic",
      "long_bio": "Currently running a small development shop in Zagreb called Neutrino, I work on stuff that has an uncanny tendency to end up on the web. My weapons of choice include PHP, JavaScript, Clojure, Python, C#, and being aware that there's an entire world of other languages, technologies, and approaches to developing software out there.\n\nI'm a big fan of free software, a regular at Zagreb's Hacklab in Mama, and a member of various Croatian tech communities.",
      "image": "http://2014.webcampzg.org/images/speakers/nikola-plejic.png",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53af0c071414141d48963a00"
    },
    "short_abstract": "Clojure is a modern Lisp targeting JVM, CLR, and JavaScript. Is waking up mid-night screaming due to unmatched parentheses worth it?",
    "language": "English",
    "title": "How, When, and Why Clojure?",
    "level": "Elementary",
    "submitted": {
      "sec": 1401147239,
      "usec": 0
    },
    "row_id": 5,
    "long_abstract": "Lisp, the influential second-oldest high-level programming language, has been called \"the most intelligent way to misuse a computer\" and \"the greatest single programming language ever designed\". Despite the prevalence of ALGOL-inspired languages, Lisp and its ideas have survived both in academia and industry through generations of programmers, although its arcane origins and seemingly odd syntax weren't always too attractive to newcomers.\n\nClojure is a recent dialect of Lisp with JVM, CLR and JavaScript as its primary targets. By combining the popularity of its well-established target platforms with a focus on functional programming and immutability, it quickly rose to fame as a modern, usable, robust general-purpose programming language.\n\nIn this talk, we'll quickly introduce Clojure and its ecosystem (why?), go through a couple of use-cases including our first-hand experience with Clojure at Neutrino (when?), and see how it fits into existing systems and plays with others (how?).\n\n(with-conference {:name \"WebCampZG 2014\"}\n    (praise \"McCarthy\"))",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bab14141403187e969e"
      },
      "github": "nikolaplejic",
      "short_bio": "I like programming computers.",
      "name": "Nikola Plejić",
      "twitter": "nikolaplejic",
      "long_bio": "Currently running a small development shop in Zagreb called Neutrino, I work on stuff that has an uncanny tendency to end up on the web. My weapons of choice include PHP, JavaScript, Clojure, Python, C#, and being aware that there's an entire world of other languages, technologies, and approaches to developing software out there.\n\nI'm a big fan of free software, a regular at Zagreb's Hacklab in Mama, and a member of various Croatian tech communities.",
      "image": "http://2014.webcampzg.org/images/speakers/nikola-plejic.png",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53d775616fc3851defc3886d"
    },
    "status": "accepted",
    "short_abstract": "Why having a single person tracking project from start to finish matters.",
    "long_abstract": "Why planning matters. Why organisational structure matters, even if you are a freelancer. Why is time tracking good for your sanity. Learn that every member of the team has his/her role with a reason. And don't bend over for your client.",
    "language": "English",
    "title": "I'll just do it myself!",
    "level": "Elementary",
    "submitted": {
      "sec": 1406628424,
      "usec": 0
    },
    "row_id": 80,
    "speaker": {
      "_id": {
        "$id": "53d775606fc3851defc3886c"
      },
      "github": "",
      "short_bio": "If I see a mess, I need to sort it out. ",
      "name": "Lora Pleško",
      "twitter": "LoraLollipop",
      "long_bio": "After almost 4 years working as tester and business analyst in a company developing banking software, I decided to turn to more dynamic and faster changing environment of web and mobile technologies. I co-founded and currently work as CEO and project manager in Mašinerija. Coming from a bigger system, I cherish the knowledge I gained there and try to implement strict project procedures to our small team.",
      "image": "http://i62.tinypic.com/t9veif.jpg",
      "shirt": "Female XL"
    }
  },
  {
    "_id": {
      "$id": "53d7755e6fc3851defc38869"
    },
    "status": "accepted",
    "short_abstract": "The talk is about the app development process that covers user experience and design trough the example of the Ministry of Sound mobile app. ",
    "long_abstract": "The talk is about showing the whole process we went with the client, and a discussion why we choose some non standard patterns. Also It's about what software and props we use in our process, and the problems we came across (internally and with the client) and how to solve them.",
    "language": "English",
    "title": "Ministry of sound case study",
    "level": "Elementary",
    "submitted": {
      "sec": 1406549364,
      "usec": 0
    },
    "row_id": 78,
    "speaker": {
      "_id": {
        "$id": "53d7755d6fc3851defc38868"
      },
      "github": "",
      "short_bio": "I'm a screen designer with over 8 years of experience, and I'm currently working in Five minutes as the lead designer. ",
      "name": "Andrej Radišić",
      "twitter": "",
      "long_bio": "I'm a screen designer and I worked for Proximity zagreb for five years, also I freelanced when I was in college for different design studios and clients. My focus is always on screen design and I'm currently working on mobile interfaces at Five minutes as the lead designer for our design team.",
      "image": "https://www.dropbox.com/s/0712gritxmm2zh9/AR_photo.png",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53db39441414141e04df2aba"
    },
    "status": "accepted",
    "short_abstract": "High-availability, high-scalability, high-performance are buzzwords which are pretty common these days, but what do they all actually mean? I'll try to explain this in end-to-end connectivity, from your average Joe user loose ADSL connection all the way to the last poorly written database query.",
    "long_abstract": "Delivering content from all web services is a tricky deal. This talk will cover average Joe trying to access your site and all the mishaps that could happen along the way with possible solutions. This includes network routing (with a touch of Net Neutrality issues), basic Internet description as a best-effort network, CDN usage, proper caching and cache invalidation, HTTP headers, poorly configured corporate proxy servers, bare-metal, cloud (Amazon and Azure) and VPS choices, outside malicious interference (DDoS), data center connectivity, database offloading - all this derived from a hosting perspective and experience with a sum of approximately billion page-views monthly.",
    "language": "English",
    "title": "HA!",
    "level": "Elementary",
    "submitted": {
      "sec": 1406845936,
      "usec": 0
    },
    "row_id": 98,
    "speaker": {
      "_id": {
        "$id": "53db39431414141e04df2ab9"
      },
      "github": "",
      "short_bio": "I do everything to make average Joe user happy when getting content from your site. I'm Customer care, Project manager, Linux systems engineer, Storage administrator and a DevOps specialist with a dash of networking flair. My everyday tools include a crystal ball which I consult very often and I possess a spider-sense awareness of services health, no joke :)",
      "name": "Tomislav Raseta",
      "twitter": "traseta",
      "long_bio": "http://careers.stackoverflow.com/tomislavraseta\n\nI'll write a summary if accepted :)",
      "image": "https://media.licdn.com/media/p/3/005/068/2c5/3cbfd7d.jpg",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53d4d7696fc385384df66191"
    },
    "status": "accepted",
    "short_abstract": "We'll talk about the importance of a good web API, cover REST and RPC, show best and worst practices, and try to convince you that API design matters.",
    "long_abstract": "Far from its humble beginnings as a way to present content to visitors, the Web today is as much about APIs as it is about content. With mobile and JavaScript-heavy applications becoming the dominant way to interact online, APIs connecting the frontend applications with the backend services are also becoming more important. This is even more so when the API is exposed to 3rd-party (client, mobile and mashup) developers.\n\nBut building a good API is still more an art than a science for many. Although there are best practices, they are not widely known or they are ignored, and when the problems become apparent in production, it's too late.\n\nThis talk will talk about the importance of good web API, show best practices, show worst practices (and argue why they're bad), and hopefully convince you to pay attention to your APIs even if \"nobody but devs can see it\".\n",
    "language": "English",
    "title": "How to build a web API",
    "level": "Intermediate",
    "submitted": {
      "sec": 1405726628,
      "usec": 0
    },
    "row_id": 69,
    "speaker": {
      "_id": {
        "$id": "53d4d7696fc385384df66190"
      },
      "github": "senko",
      "short_bio": "A practitioning bit-shifting magician turned cat herder. Runs Good Code, a team of passionate web developers working on projects all around the world.",
      "name": "Senko Rasic",
      "twitter": "senkorasic",
      "long_bio": "Senko runs a web development shop by day and experiments with programming languages by night. Programmer since the days of C64, for the past few years he's worked on all kinds of web application projects.\n\nLately he spends his days with an email client and spreadsheet more than a code editor, and he's as likely to rant about processes, methodologies and go-to-market strategies as to rant about generalized algebraic data types in Haskell and concurrency in Go.\n\nHe's \n\nSenko Rašić je zaljubljenik u programiranje od kad je kao klinac na poklon dobio C64 bez igrica, a u open source od kad je otkrio Linux. U zadnje vrijeme sve manje programira, a sve više vremena provodi vodeći tvrtku Dobar Kod koja se bavi razvojem web aplikacija za klijente širom svijeta.\n\n",
      "image": "https://www.dropbox.com/s/po503wgucr2b5tr/Senko-Hipster-Avatar-2.jpg?dl=1",
      "shirt": "Male XXL"
    }
  },
  {
    "_id": {
      "$id": "53d8d4946fc3853a3b4ff4d9"
    },
    "status": "accepted",
    "short_abstract": "Storytelling isn't something that should be scorned at, but embraced and used to its full potential to solve real problems.",
    "long_abstract": "When someone says \"storytelling\", either marketing or children bedtime stories come to mind. Both are valid, but far from being the only places storytelling appears in. Stories are illustrative, easily memorable and often reach us on an emotional level. They are very much a part of design and engineering cultures today, it's just that often we're not consciously aware of them. Let us go through some examples and see how you can use storytelling to improve motivation, planning, hiring and changing perspectives. Whatever we tell ourselves, people don't respond to reason, they respond to emotion. It doesn't matter if you're a project manager, a freelance designer or a developer in an agile team - this is bigger than a simple job title.",
    "language": "English",
    "title": "Storytelling in design and engineering",
    "level": "Elementary",
    "submitted": {
      "sec": 1406646893,
      "usec": 0
    },
    "row_id": 82,
    "speaker": {
      "_id": {
        "$id": "53d8d4926fc3853a3b4ff4d7"
      },
      "github": "merlinrebrovic",
      "short_bio": "Designer. Engineer. Wizard.",
      "name": "Merlin Rebrovic",
      "twitter": "merlinrebrovic",
      "long_bio": "Merlin works as an interaction designer at Google and YouTube. With a computer science degree and a few years of working experience as a software engineer, he shifted to design realizing that you need both design and engineering to make great products. When not building something new, Merlin can be found reading or relaxing in nature. ",
      "image": "http://merlin.rebrovic.net/pub/profile_HD.jpg",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53d8d4936fc3853a3b4ff4d8"
    },
    "status": "accepted",
    "short_abstract": "Creating a very bad chart is as easy as creating a very good one. Learn the difference and apply it in your work.",
    "long_abstract": "Visualization serves to convert data into meaningful information. Modern software allows building a vast array of charts and tables through GUI or API, but more options doesn't mean better outcomes. People often abuse available features and create monstrosities. Let us go through the basics and forever change the way you create charts - everyone will be impressed by your work.",
    "language": "English",
    "title": "Beautiful and functional charts",
    "level": "Elementary",
    "submitted": {
      "sec": 1406646505,
      "usec": 0
    },
    "row_id": 81,
    "speaker": {
      "_id": {
        "$id": "53d8d4926fc3853a3b4ff4d7"
      },
      "github": "merlinrebrovic",
      "short_bio": "Designer. Engineer. Wizard.",
      "name": "Merlin Rebrovic",
      "twitter": "merlinrebrovic",
      "long_bio": "Merlin works as an interaction designer at Google and YouTube. With a computer science degree and a few years of working experience as a software engineer, he shifted to design realizing that you need both design and engineering to make great products. When not building something new, Merlin can be found reading or relaxing in nature. ",
      "image": "http://merlin.rebrovic.net/pub/profile_HD.jpg",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53be31661414142bd88c6687"
    },
    "status": "accepted",
    "short_abstract": "Building the right (digital) product to a high standard quickly.",
    "long_abstract": "Building the right product to a high standard quickly should be the goal of any product team. When programming, the priority is to write code that is correct first and foremost - it solves the problem correctly and consistently. After that, it should be \"beautiful\". Then, and only then, do we optimise. But what does it mean to be \"correct, beautiful and fast\" when building a product?",
    "language": "English",
    "title": "Correct, Beautiful, Fast product development",
    "level": "Elementary",
    "submitted": {
      "sec": 1404406876,
      "usec": 0
    },
    "row_id": 57,
    "speaker": {
      "_id": {
        "$id": "53be2e4b1414141c504dcab5"
      },
      "github": "rodreegez",
      "short_bio": "Likes programming computers, food, wine, beer and long walks on the beach.",
      "name": "Adam Rogers",
      "twitter": "rodreegez",
      "long_bio": "I'm a developer at Mint Digital in London. I work on Mint's proprietary products as well as products for our clients. There is nothing that diverts my attention more than finding the right solution to a problem.",
      "image": "https://www.dropbox.com/s/3upian01vb9r0fk/me_cool.jpg",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53b1d3cf141414115c7c9b0b"
    },
    "short_abstract": "On what I hate about front-end web development and what tools and methods to use to ease the pain.",
    "language": "English",
    "title": "Front-end h8#ff0000!!1;",
    "level": "Intermediate",
    "submitted": {
      "sec": 1404166043,
      "usec": 0
    },
    "row_id": 51,
    "long_abstract": "The talk is about front-end web development of a larger web-applications within a medium-sized development team.\nThe emphasis will be on importance of coding style, naming conventions, keeping your codebase small and clean, code reviews, continuous measurements, code cleanup, (automated) visual testing, etc.\nMethods, tools and workflow will be mentioned.\nAlso, an interesting novel approach towards continuous visual regression testing will be presented, currently with a working name WizEye - an automation tool that notifies you whenever you visual design gets broken.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53b1d3cf141414115c7c9b0a"
      },
      "github": "sedovsek",
      "short_bio": "R&D at @CeltraMobile, a PhD student.\nA full-time continuously learning passionately curious enthusiast.\nhttp://galjot.si/about",
      "name": "Robert Sedovšek",
      "twitter": "sedovsek",
      "long_bio": "Robert Sedovšek is a PhD candidate at the University of Ljubljana (title of thesis: Evaluation of user experience in mobile advertising) and elected assistant professor in the field of information and graphic technologies. He has 7 years experience in web development/design.\nCurrently employed at Celtra Mobile as a researcher/developer, mainly working with front-end technologies to develop different tools for digital display advertising industry, such as campaign management dashboard, media analytics and many more.\n\nHe is also a mentor to many brilliant young engineers working on a different internal projects in the field of front-end technologies, such as form (re)design library, chart creation library, UI Pattern Library, WizEye - continuous visual testing tool, etc.",
      "image": "http://galjot.si/sedovsek.jpg",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53d4d7696fc385384df66194"
    },
    "status": "accepted",
    "short_abstract": "Introduction to basics of Google Glass development using Google Mirror API",
    "long_abstract": "There are two ways to develop Google Glass application. Advanced method is using standard GDK (Android) development for building native applications that run on Glass. However, Google has made it possible for web developers with no Java/Android knowledge to build simple applications and interact with Google Glass using REST services and their knowledge of web development. This demo is targeting web developers with basic knowledge of REST",
    "language": "English",
    "title": "Google Glass for Web Developers",
    "level": "Intermediate",
    "submitted": {
      "sec": 1406217546,
      "usec": 0
    },
    "row_id": 71,
    "speaker": {
      "_id": {
        "$id": "53d4d7696fc385384df66193"
      },
      "github": "dselmanovic",
      "short_bio": "Software developer with over 15 years of experience creating wonderful things in different development platforms. Engaged as one of one of TopTal freelancers and Head of development in DevLogic Sarajevo",
      "name": "Demir Selmanovic",
      "twitter": "",
      "long_bio": "Developer and project manager with over 15 years of professional experience in a wide range of software development roles. Excels as a solo developer, team member, team leader, or manager of multiple distributed teams. Working closely with clients to define ideas and deliver products. Latest personal preference is NodeJS and Android development but looking at history it is likely to change again in the next few years.",
      "image": "https://www.toptal.com/uploads/user/photo/27528/large_001.jpg",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53b1d3ce141414115c7c9b02"
    },
    "short_abstract": "When and Why would you undertake a large scale refactoring that spans more than one module or subsystem and  advice on how to approach it.",
    "language": "English",
    "title": "Large scale refactoring",
    "level": "Intermediate",
    "submitted": {
      "sec": 1404137931,
      "usec": 0
    },
    "row_id": 46,
    "long_abstract": "Refactoring on a small scale, shielded by the public interface of the module or class you are refactoring is a common and well understood activity. However, quite often, when the refactoring should rewire a larger part of the system and cross module boundaries, we shun from it. And we have very good reasons, ranging from the difficulty of doing it in small increments to the fear that it will break everything. However, in some cases, the long term benefits outweigh the cost of refactoring and when approached and executed correctly, you can emerge from it with less technical debt, easier to understand codebase and greater motivation for adding new features. ",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53b1d3ce141414115c7c9b01"
      },
      "github": "radanskoric",
      "short_bio": "A software engineer with a degree in mathematics based in Zagreb with a passion for elegant code and great user experiences. ",
      "name": "Radan Skorić",
      "twitter": "",
      "long_bio": "Hi, my name is Radan Skorić. I have a degree in mathematical engineering from university of Zagreb. As a high school student I participated in many programming competitions and worked on Urban Jungle, an award winning 3D educational game. While finishing my degree I started working as one of the first employees in DRAP, first regional company specializing in Facebook applications. After a few years I went to work on Readcube, a document management system for scientific articles affiliated with Nature magazine. Now, I am at Toptal, a marketplace for top developers and top companies, working in the internal engineering team on various aspects of the software platform powering the network. ",
      "image": "https://avatars0.githubusercontent.com/u/1065097?s=460",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53af0c0d1414141d48963a1a"
    },
    "short_abstract": "What's the best setup for a site with multiple mediums? Building a site that works for web, mobile web, and app functionality isn't simple.",
    "language": "English",
    "title": "Architecting Web and Mobile Apps",
    "level": "Elementary",
    "submitted": {
      "sec": 1403208457,
      "usec": 0
    },
    "row_id": 31,
    "long_abstract": "What's the best setup for a site serving multiple mediums? We'll investigate some architectures and how they scale for new extensions and mediums. Easy information you can start using today to best prepare your site for future expansion into web, mobile web, and app user spaces.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bb114141403187e96b3"
      },
      "github": "stevetauber",
      "short_bio": "Steve Tauber balances technical expertise and customer relations to deliver award winning web and mobile applications.",
      "name": "Steve Tauber",
      "twitter": "stevetauber",
      "long_bio": "Steve Tauber balances technical expertise and customer relations to deliver award winning web and mobile applications. His background in supporting cutting-edge infrastructure for national ISPs adds to an already diverse skill set. In his free time, Steve supports the Seattle Sounders while lamenting his recent DOTA2 loss.",
      "image": "https://scontent-b-vie.xx.fbcdn.net/hphotos-xpa1/t1.0-9/12853_192422882436_5289355_n.jpg",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53af0c081414141d48963a06"
    },
    "short_abstract": "Scrum is great. But Projects can fail with Scrum. How? If you do not have right environment, right people, and right attitude it can be a pain. You should always have a right approach!",
    "language": "Croatian",
    "title": "Scrum Traps",
    "level": "Intermediate",
    "submitted": {
      "sec": 1401445342,
      "usec": 0
    },
    "row_id": 11,
    "long_abstract": "You are Web developer! But you have a problem with your project? Use Scrum. But how to use it properly you may ask. Well, listen this topic and you will find out!",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bad14141403187e96a3"
      },
      "github": "",
      "short_bio": "Nenad Trajkovski was born in Zagreb. His major responsibility is Project Management and , in large companies. He is Project manager in PERPETUUM MOBILE d.o.o., Zagreb. He is regular speaker at Microsoft WINDAYS, MS VIZIJA and MS SINERGIJA conferences. In last 5 years he is in the top 5 speakers. He is trainer in Project Management and MS Project in various countries. He is PMP (Project Management Professional). He is professional trainer for PMP (Project Management Professional) and RMP (Risk Management Professional), and MS PROJECT. Hi is MVP for MS PROJECT., and Certified Scrum Master\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n",
      "name": "Nenad Trajkovski",
      "twitter": "ntrajkovski",
      "long_bio": "Nenad Trajkovski was born in Zagreb. His major responsibility is Project Management and , in large companies. He is Project manager in PERPETUUM MOBILE d.o.o., Zagreb. He is regular speaker at Microsoft WINDAYS, MS VIZIJA and MS SINERGIJA conferences. In last 5 years he is in the top 5 speakers. He is trainer in Project Management and MS Project in various countries. He is PMP (Project Management Professional). He is professional trainer for PMP (Project Management Professional) and RMP (Risk Management Professional), and MS PROJECT. Hi is MVP for MS PROJECT.\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t\n",
      "image": "https://www.facebook.com/photo.php?fbid=517733214981341&set=t.100000391569052&type=3&src=https%3A%2F%2Ffbcdn-sphotos-d-a.akamaihd.net%2Fhphotos-ak-xaf1%2Ft31.0-8%2F901218_517733214981341_1158480369_o.jpg&smallsrc=https%3A%2F%2Ffbcdn-sphotos-d-a.akamaihd.net%2Fhphotos-ak-xpa1%2Ft1.0-9%2F1378762_517733214981341_1158480369_n.jpg&size=1366%2C2048",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53d8d4986fc3853a3b4ff4dd"
    },
    "status": "accepted",
    "short_abstract": "An overview of different techniques for architecting your application",
    "long_abstract": "Models, sure. That’s all part of MVC. Those are the objects that hold your business logic. Except…do they really? In PHP, the norm is to have an anemic domain model. Even if you want to move away from that (whatever it is), how do you do it? In this talk, we’ll look at different schools of thought for managing your code’s truly important parts and the impact on related areas like testing or form libraries. From plain models to service layers, DDD to CQRS, we’ll try to apply them to an average application using PHP libraries and see where they stand up or fall down. There’s no magic elixar for designing good models but sometimes all you need is a little iron in your diet.",
    "language": "English",
    "title": "Models and Service Layers; Hemoglobin and Hobgoblins",
    "level": "Intermediate",
    "submitted": {
      "sec": 1406677832,
      "usec": 0
    },
    "row_id": 84,
    "speaker": {
      "_id": {
        "$id": "53d8d4976fc3853a3b4ff4dc"
      },
      "github": "rosstuck",
      "short_bio": "Independent consultant and engineer",
      "name": "Ross Tuck",
      "twitter": "rosstuck",
      "long_bio": "will update later :)",
      "image": "https://pbs.twimg.com/profile_images/655208872/ross2.jpg",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53d8d49d6fc3853a3b4ff4e1"
    },
    "status": "accepted",
    "short_abstract": "An 102 class in HTTP, going beyond just the verbs to a few more features.",
    "long_abstract": "What is an etag, exactly? What's all that stuff in the Accept header? And what the heck does a Vary header do anyways?! Web developers use HTTP everyday but most of us don't know how to get the most out of it. This talk goes past memorizing status codes (although we'll see those too) and teaches how to get the most out of every request and response.",
    "language": "English",
    "title": "HTTP & Your Angry Dog",
    "level": "Intermediate",
    "submitted": {
      "sec": 1406678196,
      "usec": 0
    },
    "row_id": 88,
    "speaker": {
      "_id": {
        "$id": "53d8d4976fc3853a3b4ff4dc"
      },
      "github": "rosstuck",
      "short_bio": "Independent consultant and engineer",
      "name": "Ross Tuck",
      "twitter": "rosstuck",
      "long_bio": "will update later :)",
      "image": "https://pbs.twimg.com/profile_images/655208872/ross2.jpg",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53d8d4996fc3853a3b4ff4de"
    },
    "status": "accepted",
    "short_abstract": "A talk with advice about using actual advice I've received",
    "long_abstract": "Despite all the advice that's given to us, we seem intent on ignoring it. For better or worse, we rarely follow it until years later we understand what the person was trying to tell us.\n\nIn this talk, I'll share the most helpful, humiliating and hilarious pieces of advice I ever got and how they shaped my career (whether I listened or not). We'll also discuss why giving and receiving advice is important, how to handle it gracefully and why it can be so powerful. As Dijkstra said: \"We must be very careful when we give advice to younger people: sometimes they follow it!\"",
    "language": "English",
    "title": "Things I Believe Now That I'm Old",
    "level": "Elementary",
    "submitted": {
      "sec": 1406677971,
      "usec": 0
    },
    "row_id": 85,
    "speaker": {
      "_id": {
        "$id": "53d8d4976fc3853a3b4ff4dc"
      },
      "github": "rosstuck",
      "short_bio": "Independent consultant and engineer",
      "name": "Ross Tuck",
      "twitter": "rosstuck",
      "long_bio": "will update later :)",
      "image": "https://pbs.twimg.com/profile_images/655208872/ross2.jpg",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53d8d49b6fc3853a3b4ff4df"
    },
    "status": "accepted",
    "short_abstract": "Building business apps that use vector graphics...in JS!",
    "long_abstract": "Sometimes your client wants to go outside the box…model. In this talk, learn how you can build and interact with vector graphics in your browser with SVG, VML, and Javascript. We’ll talk about what tools are out there, how to keep your code clean using libraries like Backbone and Raphael and how to survive Internet Explorer.\n\nLearn about building JS applications that use vector graphics, open source libraries to make it easier, and tips on structuring your code.",
    "language": "English",
    "title": "Team Plaatjes: Building JS Applications with Vector Graphics",
    "level": "Intermediate",
    "submitted": {
      "sec": 1406678047,
      "usec": 0
    },
    "row_id": 86,
    "speaker": {
      "_id": {
        "$id": "53d8d4976fc3853a3b4ff4dc"
      },
      "github": "rosstuck",
      "short_bio": "Independent consultant and engineer",
      "name": "Ross Tuck",
      "twitter": "rosstuck",
      "long_bio": "will update later :)",
      "image": "https://pbs.twimg.com/profile_images/655208872/ross2.jpg",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53d8d49c6fc3853a3b4ff4e0"
    },
    "status": "accepted",
    "short_abstract": "Using Redis, not just for high performance but for everyday development!",
    "long_abstract": "More than some arcane NoSQL tool, Redis is a simple but powerful swiss army knife you can begin using today.\n\nThis talk introduces Redis and focuses on using it to cleanly solve everyday problems. Along the way, you'll learn how Redis can be used as an alternative to several common PHP tools.",
    "language": "English",
    "title": "Redis For the Everyday Developer",
    "level": "Elementary",
    "submitted": {
      "sec": 1406678117,
      "usec": 0
    },
    "row_id": 87,
    "speaker": {
      "_id": {
        "$id": "53d8d4976fc3853a3b4ff4dc"
      },
      "github": "rosstuck",
      "short_bio": "Independent consultant and engineer",
      "name": "Ross Tuck",
      "twitter": "rosstuck",
      "long_bio": "will update later :)",
      "image": "https://pbs.twimg.com/profile_images/655208872/ross2.jpg",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53af0c0e1414141d48963a1f"
    },
    "short_abstract": "Two statements. 1: \"We should all be getting paid to do our jobs.\". 2: \"We should all be getting paid to do open source & community work\"",
    "language": "English",
    "title": "A Penny for your Thoughts",
    "level": "Elementary",
    "submitted": {
      "sec": 1403790410,
      "usec": 0
    },
    "row_id": 36,
    "long_abstract": "I have two statements. One of them I know you are going to agree on, the other, maybe not. My first one is \"We should all be getting paid to do our jobs.\". There is no one that thinks otherwise. But most of the time, we aren't getting paid to do our jobs, or at least, not what we think our job is. For example, we are getting paid to support IE8 and not the visually impaired.\n\nMy second statement is \"We should all be getting paid to do open source and community work.\".\nWe all want to get paid for doing that, but we also want to get paid for playing video games, reading a book or going on vacation. We do open source work for fun, because we like the community, we love to learn and also to teach. So why should we get paid for that?\n\nGetting a financial reward for doing the things you want to do might be a bit idealistic, but it's also good for the company you work for. In my presentation I am going to share my thoughts on why that might be.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bb214141403187e96b7"
      },
      "github": "",
      "short_bio": "Paul is a front-end developer in The Netherlands. He's established one of the first ODLs and loves to participate in the community.",
      "name": "Paul Verbeek",
      "twitter": "Hierow",
      "long_bio": "Paul Verbeek is a front-end developer, living and working in The Netherlands where he's established the country's first Open Device Lab. In his spare time he organises meet-ups and other events, like Web Platform Doc Sprints. He tries to participate in the web community as much as he can so he can learn from the people around him and he hopes he can teach them a bit as well.\n\nAnd when he's not working he's a retro gamer, saving princesses or shooting ducks.",
      "image": "https://s.gravatar.com/avatar/718a2b839e3d3d7989896234f5dfc274?s=1280",
      "shirt": "Female L"
    }
  },
  {
    "_id": {
      "$id": "53af0c0e1414141d48963a1e"
    },
    "short_abstract": "One of our problem is to find great developers. We should stop to find the best of the best, and focus on the motivated and the talented.",
    "language": "English",
    "title": "Developing Developers",
    "level": "Elementary",
    "submitted": {
      "sec": 1403790156,
      "usec": 0
    },
    "row_id": 35,
    "long_abstract": "One of our bigger problems at the moment is finding good developers.\nBut instead of finding the best of the best, you should find the motivated and make them the best.\nHow can you be a great coach, and help new developers trancend even your own skills?\n\nLooking for expert developers can be hard, nearly impossible, because everybody is looking. We should invest in new developers with apprenticeships.\nIn my presentation I'm going to explain why that's a good idea, how you can be a good coach and what to teach during an apprenticeship.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bb214141403187e96b7"
      },
      "github": "",
      "short_bio": "Paul is a front-end developer in The Netherlands. He's established one of the first ODLs and loves to participate in the community.",
      "name": "Paul Verbeek",
      "twitter": "Hierow",
      "long_bio": "Paul Verbeek is a front-end developer, living and working in The Netherlands where he's established the country's first Open Device Lab. In his spare time he organises meet-ups and other events, like Web Platform Doc Sprints. He tries to participate in the web community as much as he can so he can learn from the people around him and he hopes he can teach them a bit as well.\n\nAnd when he's not working he's a retro gamer, saving princesses or shooting ducks.",
      "image": "https://s.gravatar.com/avatar/718a2b839e3d3d7989896234f5dfc274?s=1280",
      "shirt": "Female L"
    }
  },
  {
    "_id": {
      "$id": "53dc99be6fc3850d17182e1f"
    },
    "status": "accepted",
    "short_abstract": "When cooking a meal, you always try it before serving. Learn some of the industry's leading practices in trying your project before serving.",
    "long_abstract": "Regardless of the good product planning, UX process and efforts put into the development of the Web or mobile app, final product often misses the opportunity to communicate its abilities to users.\n\nSolving some points of product usage confusion requires significant effort, but some interface issues could be solved in matter of minutes, providing better user experience and better business results. In order to find some of the bad points of your product's experience, the best and fastest way is to do some kind of user testing. \n\nUsability testing has always been considered as complicated and expensive process intended for someone with bigger budget, more time or more knowledge. The goal of this talk is to present basic steps for conducting quick usability testing and improving product in minimum time.\n\nTalk will show usability testing best pracices and tools used at Five Minutes.",
    "language": "English",
    "title": "Try the meal before you serve it - usability testing for your product",
    "level": "Elementary",
    "submitted": {
      "sec": 1406930623,
      "usec": 0
    },
    "row_id": 103,
    "speaker": {
      "_id": {
        "$id": "53dc99bc6fc3850d17182e1e"
      },
      "github": "",
      "short_bio": "Tech guy in love with creating meaningful and beautiful products. UX designer at Five Minutes.",
      "name": "Luka Vida",
      "twitter": "lukavida",
      "long_bio": "Unfocused to some specific area which he'd like to pursue, in the last few years Luka has done frontend, graduating from FER, leading the student organization eSTUDENT, and has finally landed in position which covers multiple areas he's interested in. Passionate about changing the surroundings using the technology, he is designer of user experience on products Five Minutes is delivering. Interests reach from architecture and psychology to machine learning and computer vision. Unfortunately, life is too short, so UX design will do.",
      "image": "https://dl.dropboxusercontent.com/u/140336/LukaVida/LukaVidaSquare.jpg",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53af0c0c1414141d48963a18"
    },
    "short_abstract": "Kako navesti punokrvne C/C++ aplikacije (s gotovo istovjetnim performansama) na izvršavanje unutar web browsera (trenutno isključivo u Chromeu) i ima li to smisla i kada. ",
    "language": "Croatian",
    "title": "Web na C/C++ pogon ",
    "level": "Intermediate",
    "submitted": {
      "sec": 1403116941,
      "usec": 0
    },
    "row_id": 29,
    "long_abstract": "Native Client (NaCl) je open-source Google-ova tehnologija koja omogućuje izvršavanje (za sada samo)  C/C++ aplikacija unutar web browsera. U trenutnom razvoju web aplikacija bez obzira na moć JavaScripta te pripadajućih frameworka (poseban naglasak na brzi asm.js) za potrebe zahtjevnijih kalkulacija poseže se ipak za izvođenjem istih  na serveru ili korištenjem drugih client tehnologija (Flash, Silverlight, Java appleti..). No ako imamo stari već napisani i dobro testirani kod  mogućnost reusea sve je privlačnija, a pogotovo ako želimo iskoristiti maksimum audio i grafičkih mogućnosti tu zapravo osim Native Client i nemamo  previše izbora . 'Portable' varijanta PNaCl zajedno s pripadajućim Pepper API-jem je dobar izbor za takav razvoj. Prezentacija se sastoji od pregleda mogućnosti NaCl-a, prednosti i mane istog, kako započeti s razvojem , te osobnog zaključka  kada i zašto upotreba ove tehnologije ima smisla. Naravno sve popraćeno s primjerima i dobrim starim C++ kodom. ",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bb114141403187e96b1"
      },
      "github": "",
      "short_bio": "Programer već zadnjih 25 godina a zabavljao sam se programiranjem još iz vremena kad su C64,ZX Spectrum i Apple II bili carevi. ",
      "name": "Tomislav Vidaković",
      "twitter": "",
      "long_bio": "Programer i architect, osmislio vodio i realizirao više vrlo aktivnih projekata u banci u kojoj i sada radim.Prethodni projekti vezani su od realizacije internet radjia i programiranja Scade do klasičnih bussines aplikacija. Primarna tehnologija su mi Java, Spring te Vaadin i Flash. U slobodno vrijeme spajam programiranje i glazbu kroz  'live coding' korištenjem SuperCollider-a.",
      "image": "C:\\Users\\Danijela\\Documents\\Youcam\\tv.png",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53b1d3cf141414115c7c9b07"
    },
    "short_abstract": "Go is a programming language with focus on concurrency, performance and safety - just what you need to write server applications.\n",
    "language": "English",
    "title": "Writing servers with Go",
    "level": "Intermediate",
    "submitted": {
      "sec": 1404151632,
      "usec": 0
    },
    "row_id": 49,
    "long_abstract": "Go was initially created by Google as 'better C' - a safe, fast and productive language for systems programming. It turned out that the same qualities, coupled with its first-class support for concurrency, make it a very interesting choice for implementing backend server applications. \n\nThis presentation will introduce you to Go platform and its strengths. It will explain why you might want to use it, what kind of applications it excels at and how it stacks against other technologies like Node.js or Erlang/Elixir. Since nothing is perfect, Go's downsides and shortcomings will also be discussed, as well as some lessons learned from using Go to rewrite infrastructure code for payment processing software.\n",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53b1d3ce141414115c7c9b05"
      },
      "github": "zdeslav",
      "short_bio": "Freelance software developer, with more than 15 years of experience, mostly doing C++, Python and .NET. ",
      "name": "Zdeslav Vojković",
      "twitter": "zdeslav_v",
      "long_bio": "Zdeslav Vojkovic started programming ages ago, when ZX Spectrum and C64 were synonyms for home computer. \n\nHe writes code professionally for more than 15 years, has worked in various industries, from automotive to financial, and is co-owner of a small software development workshop where he works as a consultant/contractor/whatever for various clients whom he tries to educate about advantages of open source software.\n\nIn his spare time, he tries to tame his three kids, without significant success.\n",
      "image": "http://2014.webcampzg.org/images/speakers/zdeslav-vojkovic.png",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53b1d3ce141414115c7c9b06"
    },
    "short_abstract": "ZeroMQ is a messaging library which lets you write scalable and performant distributed software. Or, as some say, sockets on steroids.\n",
    "language": "English",
    "title": "ZeroMQ - toolset for high-performance distributed applications",
    "level": "Advanced",
    "submitted": {
      "sec": 1404151618,
      "usec": 0
    },
    "row_id": 48,
    "long_abstract": "ZeroMQ has quite a misleading name. It is not really a classic message queuing solution at all - it is a messaging library which simplifies the task of writing high-performance and scalable distributed applications.\n\nZeroMQ abstracts the standard sockets and provides building blocks for almost any distributed scenario and topology: from classic publish-subscribe pattern between independent services to cross-thread communication inside a process, while introducing a very low overhead, compared to alternatives. It integrates well with whole range of technologies from Python and Ruby, over Java and C# to C++ and Go.\n\nThis talk will discuss various distributed/concurrent scenarios and show how ZeroMQ helps to implement appropriate solutions. Of course, the pitfalls and limitations will be discussed, too.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53b1d3ce141414115c7c9b05"
      },
      "github": "zdeslav",
      "short_bio": "Freelance software developer, with more than 15 years of experience, mostly doing C++, Python and .NET. ",
      "name": "Zdeslav Vojković",
      "twitter": "zdeslav_v",
      "long_bio": "Zdeslav Vojkovic started programming ages ago, when ZX Spectrum and C64 were synonyms for home computer. \n\nHe writes code professionally for more than 15 years, has worked in various industries, from automotive to financial, and is co-owner of a small software development workshop where he works as a consultant/contractor/whatever for various clients whom he tries to educate about advantages of open source software.\n\nIn his spare time, he tries to tame his three kids, without significant success.\n",
      "image": "http://2014.webcampzg.org/images/speakers/zdeslav-vojkovic.png",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53af0c061414141d489639fd"
    },
    "short_abstract": "See why this award winning Python project has relevance for your work life through getting your servers under control",
    "language": "English",
    "title": "Ansible, just orchestrate it",
    "level": "Intermediate",
    "submitted": {
      "sec": 1400967600,
      "usec": 0
    },
    "row_id": 2,
    "long_abstract": "Everyone should be using Vagrant or some similar tool for local developer environment.\nStill those containers/VMs need to be configured somehow and on top of that your configuration system should be able to manage your staging and production servers as well, you could be using Puppet, Chef, Salt, shell scripts to achieve this.\nRecently a 3rd generation configuration management system has thown its hat into the ring, and that tools name is Ansible.\nThe talk will show how Ansible approaches configuration management, software deployment, remote execution and other tasks.\nWe will examine how easy it is to get up and running and manage single or multiple concurrent servers in parallel, what are the differences to Puppet, Chef etc and how to customize Ansible to your needs. \n\nJoin us for this talk and you’ll see why this award winning Python project has relevance for your work life through getting your servers under control.\n",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0baa14141403187e969b"
      },
      "github": "vranac",
      "short_bio": "I am a developer, consultant, mercenary (used to be known as freelancing), writing terrible code that performs exceptionally, wrangling elePHPants and pythons\n",
      "name": "Srdjan Vranac",
      "twitter": "vranac",
      "long_bio": "I am a developer, consultant, mercenary (used to be known as freelancing).\nI lead a small team that works on various projects ranging from small family businesses to Fortune 500 companies.\nI write terrible code that performs exceptionally and currently I am wrangling elePHPants and Pythons....\nMy Interests are process automation, continuous integration and delivery, clean code, testing, best practices (you have to know them so you can break them if you have to), distributed systems\n",
      "image": "http://2014.webcampzg.org/images/speakers/srdjan-vranac.png",
      "shirt": "Male XXL"
    }
  },
  {
    "_id": {
      "$id": "53af0c061414141d489639fc"
    },
    "short_abstract": "How to make your web app perform better by using background tasks and queue systems",
    "language": "English",
    "title": "Shifting Gears with Gearman",
    "level": "Intermediate",
    "submitted": {
      "sec": 1400965632,
      "usec": 0
    },
    "row_id": 1,
    "long_abstract": "Everyone starts with a simple one-machine setup, running PHP, MySQL and Apache/NGINX. Sooner or later that will not be enough, and you will be faced with some important architecture decisions. This talk will show you how you can optimize and increase the performance of your application by distributing tasks in an simple and affordable way.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0baa14141403187e969b"
      },
      "github": "vranac",
      "short_bio": "I am a developer, consultant, mercenary (used to be known as freelancing), writing terrible code that performs exceptionally, wrangling elePHPants and pythons\n",
      "name": "Srdjan Vranac",
      "twitter": "vranac",
      "long_bio": "I am a developer, consultant, mercenary (used to be known as freelancing).\nI lead a small team that works on various projects ranging from small family businesses to Fortune 500 companies.\nI write terrible code that performs exceptionally and currently I am wrangling elePHPants and Pythons....\nMy Interests are process automation, continuous integration and delivery, clean code, testing, best practices (you have to know them so you can break them if you have to), distributed systems\n",
      "image": "http://2014.webcampzg.org/images/speakers/srdjan-vranac.png",
      "shirt": "Male XXL"
    }
  },
  {
    "_id": {
      "$id": "53db39431414141e04df2ab6"
    },
    "status": "accepted",
    "short_abstract": "This presentation shows web developers how to build next-generation web apps using various Web Components (native and Polymer framework).",
    "long_abstract": "Web Components (ie. HTML Templates, Shadow DOM, Custom Elements and HTML Imports) are the highlight of current web standards development, with Google and Mozilla pioneering the implementation of the specification draft. While numerous presentations all over the world have introduced Web Components to web developers, not many have demonstrated the practical aspects. This presentation will use existing tools to show web developers how they can make next-generation web apps using custom HTML elements from a wide spectrum of vendors – from giants such as Google to open-source enthusiasts on GitHub.",
    "language": "English",
    "title": "Get Practical with Web Components",
    "level": "Intermediate",
    "submitted": {
      "sec": 1406839852,
      "usec": 0
    },
    "row_id": 96,
    "speaker": {
      "_id": {
        "$id": "53db39431414141e04df2ab5"
      },
      "github": "warpech",
      "short_bio": "Creative technologist implementing Web Components at Starcounter and maintaining an open source data grid editor, Handsontable.",
      "name": "Marcin Warpechowski",
      "twitter": "warpech",
      "long_bio": "Marcin Warpechowski is a developer at Starcounter. He builds web applications with emerging Open Web Platform technologies, including Web Components, and is the creator of an open source data grid editor, Handsontable. He lives in Gdynia, Poland.",
      "image": "https://dl.dropboxusercontent.com/u/313942/Marcin%20_W.png",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53af0c061414141d489639ff"
    },
    "short_abstract": "We will explore recipes on how to migrate the DB and deploy the code without causing application errors or downtime.",
    "language": "English",
    "title": "Zero-downtime deployments with DB migrations",
    "level": "Intermediate",
    "submitted": {
      "sec": 1401142493,
      "usec": 0
    },
    "row_id": 4,
    "long_abstract": "When adding a table or a column, it's usually safe to simply execute a DB migration before the code deployment. However, removing a column can be more difficult, but not nearly as much as renaming a whole table. Some developers solve this problem by taking an application down for maintenance, thus hurting users.\n\nIn this talk we'll explore how to handle these tricky situations without affecting a single user and looking at specific recipes for various migration types. We'll look beyond databases and touch on compatibility between back-end and front-end code and mention other details that could trip you up.\n\nWe'll use Ruby on Rails, PostgreSQL and Heroku for illustrations, but the ideas could be reused with any backend or deployment platform.\n\nThe approaches are inspired by this post, but will expand upon it: http://pedro.herokuapp.com/past/2011/7/13/rails_migrations_with_no_downtime/",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bab14141403187e969d"
      },
      "github": "sidonath",
      "short_bio": "I write Ruby and JavaScript/CoffeeScript, run, hang out above the city with my fiancé and a camera. Adopted by two cats: Mogwai and Midori.",
      "name": "Damir Zekić",
      "twitter": "sidonath",
      "long_bio": "Damir has been developing web applications for over ten years and is currently working on STCKbay, a fashion marketplace, using Ruby on Rails and Ember.js.\n\nSince March 2013 Damir has been organizing Sarma: Sarajevo Ruby meetups and helped organize two BarCamps in Sarajevo in 2012 and 2013.\n\nWhen not working, he's still writing code either to learn a new language, explore a new framework, or contribute to OSS. When not writing code, he can be seen running, hiking or taking photos.",
      "image": "http://f.cl.ly/items/3V011Y061R281R39160P/damir.png",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53d4d76a6fc385384df66197"
    },
    "status": "accepted",
    "short_abstract": "It may be hard to start writing FP code until you start to think functionally. Turns out you can do it in almost all modern OOP languages!",
    "long_abstract": "The goal of this talk is to show easy steps for transitioning from OOP to functional programming.\n\nWe'll start this talk with explaining the benefits of functional programming and discussing the stigma that's associated with it. After that we'll see how FP languages are getting used in real life and that we can indeed write a web app using solely FP languages.\n\nAfter that we'll show samples of functional code as written in many OOP languages (JavaScript, C# and Ruby) and compare it to the implementation in F#, an FP language.\n\nThis talk was already held at Developers Arena in Sarajevo in a slightly trimmed version (20 min). The slides are available: https://speakerdeck.com/damir/oop-and-fp-bridging-the-gap",
    "language": "English",
    "title": "OOP and FP: Bridging the Gap",
    "level": "Intermediate",
    "submitted": {
      "sec": 1406304563,
      "usec": 0
    },
    "row_id": 73,
    "speaker": {
      "_id": {
        "$id": "53af0bab14141403187e969d"
      },
      "github": "sidonath",
      "short_bio": "I write Ruby and JavaScript/CoffeeScript, run, hang out above the city with my fiancé and a camera. Adopted by two cats: Mogwai and Midori.",
      "name": "Damir Zekić",
      "twitter": "sidonath",
      "long_bio": "Damir has been developing web applications for over ten years and is currently working on STCKbay, a fashion marketplace, using Ruby on Rails and Ember.js.\n\nSince March 2013 Damir has been organizing Sarma: Sarajevo Ruby meetups and helped organize two BarCamps in Sarajevo in 2012 and 2013.\n\nWhen not working, he's still writing code either to learn a new language, explore a new framework, or contribute to OSS. When not writing code, he can be seen running, hiking or taking photos.",
      "image": "http://f.cl.ly/items/3V011Y061R281R39160P/damir.png",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53d4d76b6fc385384df6619e"
    },
    "status": "accepted",
    "short_abstract": "Change your way of thinking about responsive web design, by focusing on making the elements themselves adapt to different contexts.",
    "long_abstract": "Web components are becoming a part of our mainstream developer toolset, but we still haven't unlocked their true potential. And that is the re-usability which will allow us to compose totally new pages from existing elements. But how do you ensure that you can reuse an element  in a totally different context? How do you know that you can use an element both in your website's main area of eg. 1000px and in your website's sidebar of 300px and it would still look and function properly? In this talk we will see how we can combine web components with the concept of element queries and create responsive components that can adapt to their environment",
    "language": "English",
    "title": "Responsive Web Components - A glimpse at the future",
    "level": "Intermediate",
    "submitted": {
      "sec": 1406453709,
      "usec": 0
    },
    "row_id": 77,
    "speaker": {
      "_id": {
        "$id": "53d4d76b6fc385384df6619d"
      },
      "github": "zinas",
      "short_bio": "In constant search for the question of the answer to life, the universe and everything. In the meantime, I pass my time working as a frontend developer and focusing on web standards and technologies.",
      "name": "Nikos Zinas",
      "twitter": "nzinas",
      "long_bio": "I have been working with web technologies for about 10 years. During this time I learned to love the web, all that it represents and all the opportunities that it offers.\n\nI focus on writing clean, reusable code, I adhere to web standards and I enjoy using cutting-edge technologies that work best on modern browsers while degrading gracefully on older ones.",
      "image": "https://drive.google.com/file/d/0B4QGnOPbG2lCc00zMTlIUjdhSFE",
      "shirt": "Male M"
    }
  },
  {
    "_id": {
      "$id": "53d4d7696fc385384df66192"
    },
    "status": "accepted",
    "short_abstract": "Let's see what we can do with streams and streaming on the web.",
    "long_abstract": "What are advantages of streaming over plain ole POSTing files down the wire? What are the common issues there?\n\nHow do we combine streams? What technologies can we use on the web today to utilize streaming technologies today?\n\nIn this talk we ask those and more questions and try to answer some of them. If you like to hear about terms like backpressure, readable and writable, passthrough and aborts, this is the talk.",
    "language": "English",
    "title": "Wildest streams",
    "level": "Intermediate",
    "submitted": {
      "sec": 1406164444,
      "usec": 0
    },
    "row_id": 70,
    "speaker": {
      "_id": {
        "$id": "53af0bac14141403187e96a0"
      },
      "github": "zladuric",
      "short_bio": "Mostly harmless.",
      "name": "Zlatko Đurić",
      "twitter": "zladuric",
      "long_bio": "A JavaScript guy with a decent Linux beard. Loves tinkering with shiny new things and trying technology out, but only has a fragment of the usual programmers' OCDs that make them use all the tools.\n\nFreelances and works on interesting Node.js (and usually Angular.js) projects.",
      "image": "http://0.gravatar.com/avatar/fda09c54de7bb03f0d77127cec09fd12?size=400px",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53af0c071414141d48963a02"
    },
    "short_abstract": "What little ideas, flows and tricks I use to get the potential clients to love me and give me the project and come back for more.",
    "language": "English",
    "title": "How to hook the client in 3 steps",
    "level": "Elementary",
    "submitted": {
      "sec": 1401277028,
      "usec": 0
    },
    "row_id": 7,
    "long_abstract": "Working on various projects, from small web projects to deploying enterprise solutions, I've observed that clients love some behavior patterns and some tools and fall for certain tricks and that I can often \"sell\" the idea even if it's not technically perfect and even when there are smarter and better people around me.\n\nMost things on this list include communication. Not just a lot of communication, but also the way to present the ideas to the client and the way to talk to people.\n\nSome things concern are simple bribery.\n\nSome tools are systemic and can be used in on a project to make the client feel in control.\n\nI'm going to talk about how I do it, and I hope to get many good questions on why am I not using this or that and I'll learn a lot from those questions.\n",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bac14141403187e96a0"
      },
      "github": "zladuric",
      "short_bio": "Mostly harmless.",
      "name": "Zlatko Đurić",
      "twitter": "zladuric",
      "long_bio": "A JavaScript guy with a decent Linux beard. Loves tinkering with shiny new things and trying technology out, but only has a fragment of the usual programmers' OCDs that make them use all the tools.\n\nFreelances and works on interesting Node.js (and usually Angular.js) projects.",
      "image": "http://0.gravatar.com/avatar/fda09c54de7bb03f0d77127cec09fd12?size=400px",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53af0c061414141d489639fe"
    },
    "short_abstract": "All artefacts that break community rules, need an excellent advocate. Bug is not an exception.",
    "language": "English",
    "title": "The bug's advocate",
    "level": "Elementary",
    "submitted": {
      "sec": 1401105470,
      "usec": 0
    },
    "row_id": 3,
    "long_abstract": "Bug is very strange fellow in every project. It usually creates trouble, fights, office wars. Software tester responsibility is to not create false bugs. They must be bug's advocates. In this talk I will present on real example HICCUPPS method, method that helps software tester to identify bugs that matter. HICCUPPS method was created by James Bach and extended by Michael Bolton, two excellent software testers.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bab14141403187e969c"
      },
      "github": "karlosmid",
      "short_bio": "Karlo is dedicated to advancing the understanding of the science and practice of software testing according to Context-Driven principles.",
      "name": "Karlo Šmid",
      "twitter": "karlosmid",
      "long_bio": "After 12 years as software tester at Ericsson Nikola Tesla, Karlo decided to found second software testing company in Croatia.\nHe is one of the organisers of Zagreb Software Testing Club meetups and he actively participates in organisation of Viaqa local software testing conference.\nKarlo is member of Association for Software Testing which is dedicated to advancing the understanding of the science and practice of software testing according to Context-Driven principles.",
      "image": "https://www.dropbox.com/s/gisveugx47hdt22/ja.jpg",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53af0c0a1414141d48963a0d"
    },
    "short_abstract": "Theory, best practices and tips&tricks from a real world application of Event Sourcing.",
    "language": "English",
    "title": "Event Sourcing In Practice",
    "level": "Advanced",
    "submitted": {
      "sec": 1401979306,
      "usec": 0
    },
    "row_id": 18,
    "long_abstract": "Usually we create structural models for our applications, and then we keep track of only the final result of our complex processes - the state to which our model changed. And we persist only that state. \n\nBut what if we keep track of every event that happens in your process? And we replay those events to restore the object state when we need it. What can we gain and how?\n\nThis talk will show the advantages of this idea, and also focus on best practices that should be used when venturing into Event Sourcing.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bae14141403187e96a9"
      },
      "github": "",
      "short_bio": "Dad, husband, hacker. Occasional philosopher. Strategist. The good guy.",
      "name": "Robert Šorn",
      "twitter": "bigblacksteel",
      "long_bio": "Robert is an experienced web developer and system architect. He is currently Team leader and Head of development on njuskalo.hr at Trikoder. Involved in architecture and development of several middle and big projects in Croatia like njuskalo.hr and pixsell.hr.\nHaving accumulated years of experience, Robert strifes these days for calm, order, and perfection in every aspect of development process.",
      "image": "http://house-sorn.com/robert/robert_sorn.png",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53af0c0a1414141d48963a0e"
    },
    "short_abstract": "I believe we can all be happy at our work! Here's how.",
    "language": "English",
    "title": "Strife For Happiness",
    "level": "Elementary",
    "submitted": {
      "sec": 1401979626,
      "usec": 0
    },
    "row_id": 19,
    "long_abstract": "Our happiness and satisfaction with what we do is in our own hands!\nWe can be masters of our craft!\nI will cover how to handle clients, managers, colleagues and yourself. All with one goal - so that you are happy. And how to consequently make all of the others happy.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bae14141403187e96a9"
      },
      "github": "",
      "short_bio": "Dad, husband, hacker. Occasional philosopher. Strategist. The good guy.",
      "name": "Robert Šorn",
      "twitter": "bigblacksteel",
      "long_bio": "Robert is an experienced web developer and system architect. He is currently Team leader and Head of development on njuskalo.hr at Trikoder. Involved in architecture and development of several middle and big projects in Croatia like njuskalo.hr and pixsell.hr.\nHaving accumulated years of experience, Robert strifes these days for calm, order, and perfection in every aspect of development process.",
      "image": "http://house-sorn.com/robert/robert_sorn.png",
      "shirt": "Male XL"
    }
  },
  {
    "_id": {
      "$id": "53af0c091414141d48963a0a"
    },
    "short_abstract": "Intro into Redis, Lua scripts and debugging of Lua scripts in Redis. Real life examples of how can Redis speed up your application.",
    "language": "English",
    "title": "Redis in practice",
    "level": "Intermediate",
    "submitted": {
      "sec": 1401760371,
      "usec": 0
    },
    "row_id": 15,
    "long_abstract": "You know that old saying \"Right tool for the right job\"? I want to show you some jobs in which Redis is that right tool. We'll talk about some real life examples of how can Redis speed up your application and some of it's not so obvious usages.\n\nThere will be mentioned some interesting things about Redis as well as horizontal and vertical scaling. You want to reduce Redis network traffic and speed up whole application? No problem, just write Lua scripts that you can run inside of Redis. At some point you'll have to debug those Lua scripts and I'll show you one interesting way of how to do it.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bad14141403187e96a5"
      },
      "github": "zlikavac32",
      "short_bio": "Student on FER, Computer science section. I love artificial intelligence and algorithms. In my free time I drive my bike and go hunting.",
      "name": "Marijan Šuflaj",
      "twitter": "",
      "long_bio": "Young developer willing to learn new things and explore new technologies. Also I like to share my experience about what I know and what I have learned so far. As a student, I work for Trikoder d.o.o. and with few other developers I take care of njuskalo.hr.",
      "image": "http://2014.webcampzg.org/images/speakers/marijan-suflaj.png",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53af0c091414141d48963a08"
    },
    "short_abstract": "Uvod u Redis, Lua skripte i debugiranje Lua skripti za Redis. Primjeri iz stvarnog života kako Redis može ubrzati aplikaciju.",
    "language": "Croatian",
    "title": "Redis u praksi",
    "level": "Intermediate",
    "submitted": {
      "sec": 1401475347,
      "usec": 0
    },
    "row_id": 13,
    "long_abstract": "Zanimljivosti o redisu. Skaliranje vertikalno i horizontalno. Pisanje Lua skripti kako bi se smanjio mrežni promet i općenito se ubrzala aplikacija. Ne tako očite primjene Redisa u praksi.",
    "status": "accepted",
    "speaker": {
      "_id": {
        "$id": "53af0bad14141403187e96a5"
      },
      "github": "zlikavac32",
      "short_bio": "Student on FER, Computer science section. I love artificial intelligence and algorithms. In my free time I drive my bike and go hunting.",
      "name": "Marijan Šuflaj",
      "twitter": "",
      "long_bio": "Young developer willing to learn new things and explore new technologies. Also I like to share my experience about what I know and what I have learned so far. As a student, I work for Trikoder d.o.o. and with few other developers I take care of njuskalo.hr.",
      "image": "http://2014.webcampzg.org/images/speakers/marijan-suflaj.png",
      "shirt": "Male L"
    }
  },
  {
    "_id": {
      "$id": "53d4d76a6fc385384df66199"
    },
    "status": "accepted",
    "short_abstract": "Apache Cassandra, BigData Web-scale data platform with linear scalability and proven fault tolerance. What's behind it & how does it work?",
    "long_abstract": "A short history of Apache Cassandra, how it developed and who is using it today. The basic theoretical concepts behind it like the CAP Theorem and Consistent Hashing technique. An architecture overview and description of replication strategies. Dynamic nature of the system and how it adapts using the Gossip protocol and the Snitch. Data paths, writing, updating, removal, compaction and reading. Basic interacting with the Cassandra using the Cassandra Query Language and the CQL Shell.",
    "language": "English",
    "title": "Cassandra, web-scale NoSQL data platform",
    "level": "Intermediate",
    "submitted": {
      "sec": 1406378937,
      "usec": 0
    },
    "row_id": 74,
    "speaker": {
      "_id": {
        "$id": "53d4d76a6fc385384df66198"
      },
      "github": "msval",
      "short_bio": "Web and javascript, html5 canvas demo fan, game developer wannabe, arduino tinkerer, who recently discovered the joys of cassandra.",
      "name": "Marko Švaljek",
      "twitter": "msvaljek",
      "long_bio": "Developer working at the Machine Networks department of the Kapsch CarrierCom group. Blog author with entries ranging from HTML 5 Canvas animations to BigData stuff. Loves experimenting with the web technologies and if the circumstances allow it playing with the arduino. Recently he discovered the joys of Big data with Apache Cassandra. ",
      "image": "https://pbs.twimg.com/profile_images/460372885563924480/6nDFrud3.jpeg",
      "shirt": "Male L"
    }
  }
]